; TOTALCOM.ini
[ Собрал Составил Изменил... Аверин Андрей Averin-And@yandex.ru]
[ TCIMG 33.3 от 10.10.2023 специально для Total Commander Image]
[ Сайт поддержки http://tc-image.3dn.ru https://t.me/tcimg]
[ Версия файла 1.3 от 10.10.2023 для Total Commander 1102RC1]
; [TOTALCOM] - внутренние команды Total Commander
[TOTALCOM]
; 300=Активная: показать комментарии
cm_SrcComments=300
; 301=Активная: только имена файлов
cm_SrcShort=301
; 302=Активная: подробно
cm_SrcLong=302
; 303=Активная: дерево каталогов
cm_SrcTree=303
; 304=Активная: быстрый просмотр
cm_SrcQuickview=304
; 305=Панели одна над другой
cm_VerticalPanels=305
; 306=Активная: быстрый просмотр без плагинов
cm_SrcQuickInternalOnly=306
; 307=Активная: выключить быстрый просмотр
cm_SrcHideQuickview=307
; 311=Активная: только программы
cm_SrcExecs=311
; 312=Активная: все файлы
cm_SrcAllFiles=312
; 313=Активная: применить последний фильтр
cm_SrcUserSpec=313
; 314=Активная: задать фильтр
cm_SrcUserDef=314
; 321=Активная: сортировка по имени
cm_SrcByName=321
; 322=Активная: сортировка по типу
cm_SrcByExt=322
; 323=Активная: сортировка по размеру
cm_SrcBySize=323
; 324=Активная: сортировка по дате/времени
cm_SrcByDateTime=324
; 325=Активная: без сортировки
cm_SrcUnsorted=325
; 330=Активная: в обратном порядке
cm_SrcNegOrder=330
; 331=Активная: выбор диска
cm_SrcOpenDrives=331
; 269=Активная: просмотр эскизов
cm_SrcThumbs=269
; 270=Активная: меню пользовательских колонок
cm_SrcCustomViewMenu=270
; 332=Активная: активизировать цепочки навигации
cm_SrcPathFocus=332
; 333=Активная: меню доступных стилей оформления
cm_SrcViewModeList=333
; 100=Слева: показать комментарии
cm_LeftComments=100
; 101=Слева: только имена файлов
cm_LeftShort=101
; 102=Слева: подробно
cm_LeftLong=102
; 103=Слева: дерево каталогов
cm_LeftTree=103
; 104=Слева: быстрый просмотр
cm_LeftQuickview=104
; 106=Слева: быстрый просмотр без плагинов
cm_LeftQuickInternalOnly=106
; 107=Слева: выключить быстрый просмотр
cm_LeftHideQuickview=107
; 111=Слева: только программы
cm_LeftExecs=111
; 112=Слева: все файлы
cm_LeftAllFiles=112
; 113=Слева: применить последний фильтр
cm_LeftUserSpec=113
; 114=Слева: задать фильтр
cm_LeftUserDef=114
; 121=Слева: сортировка по имени
cm_LeftByName=121
; 122=Слева: сортировка по типу
cm_LeftByExt=122
; 123=Слева: сортировка по размеру
cm_LeftBySize=123
; 124=Слева: сортировка по дате/времени
cm_LeftByDateTime=124
; 125=Слева: без сортировки
cm_LeftUnsorted=125
; 130=Слева: в обратном порядке
cm_LeftNegOrder=130
; 131=Слева: выбор диска
cm_LeftOpenDrives=131
; 132=Слева: активизировать цепочки навигации
cm_LeftPathFocus=132
; 133=Слева: Пользовательские режимы просмотра
cm_LeftViewModeList=133
; 2034=Слева: показ файлов без подкаталогов
cm_LeftDirBranch=2034
; 2047=Слева: показ файлов без подкаталогов (только в выделенном)
cm_LeftDirBranchSel=2047
; 69=Слева: просмотр эскизов
cm_LeftThumbs=69
; 70=Слева: меню пользовательских колонок
cm_LeftCustomViewMenu=70
; 200=Справа: показать комментарии
cm_RightComments=200
; 201=Справа: только имена файлов
cm_RightShort=201
; 202=Справа: подробно
cm_RightLong=202
; 203=Справа: дерево каталогов
cm_RightTree=203
; 204=Справа: быстрый просмотр
cm_RightQuickview=204
; 206=Справа: быстрый просмотр без плагинов
cm_RightQuickInternalOnly=206
; 207=Справа: выключить быстрый просмотр
cm_RightHideQuickview=207
; 211=Справа: только программы
cm_RightExecs=211
; 212=Справа: все файлы
cm_RightAllFiles=212
; 213=Справа: применить последний фильтр
cm_RightUserSpec=213
; 214=Справа: задать фильтр
cm_RightUserDef=214
; 221=Справа: сортировка по имени
cm_RightByName=221
; 222=Справа: сортировка по типу
cm_RightByExt=222
; 223=Справа: сортировка по размеру
cm_RightBySize=223
; 224=Справа: сортировка по дате/времени
cm_RightByDateTime=224
; 225=Справа: без сортировки
cm_RightUnsorted=225
; 230=Справа: в обратном порядке
cm_RightNegOrder=230
; 231=Справа: выбор диска
cm_RightOpenDrives=231
; 232=Справа: активизировать цепочки навигации
cm_RightPathFocus=232
; 233=Пользовательские режимы просмотра
cm_RightPathFocus=233
; 2035=Справа: показ файлов без подкаталогов
cm_RightDirBranch=2035
; 2048=Справа: показ файлов без подкаталогов (только в выделенном)
cm_RightDirBranchSel=2048
; 169=Справа: просмотр эскизов
cm_RightThumbs=169
; 170=Справа: меню пользовательских колонок
cm_RightCustomViewMenu=170
; 233=Справа: Меню стилей оформления
cm_RightViewModeList=233
; 903=Просмотр
cm_List=903
; 1006=	Внутренний просмотр без плагинов, один файл
cm_ListInternalOnly=1006
; 2933=	Внутренний просмотр без плагинов, выделение
cm_ListInternalMulti=2933
; 2934=Внутренний просмотр с плагинами, один файл
cm_ListOnly=2934
; 2935=	Внутренний просмотр с плагинами, выделение
cm_ListMulti=2935
; 3026=Просмотр внешней программой
cm_ListExternal=3026
; 904=Правка
cm_Edit=904
; 2931=Создание нового файла и его открытие через меню по F4
cm_EditNewFile=2931
; 2943=Создание нового файла с помощью меню
cm_EditFileMenu=2943
; 2932=Правка файла под курсором (Shift игнорируется)
cm_EditExistingFile=2932
; 905=Копировать файлы
cm_Copy=905
; 3100=Копировать в ту же панель
cm_CopySamepanel=3100
; 3101=Копировать в другую панель
cm_CopyOtherpanel=3101
; 906=Переименовать/Переместить файлы
cm_RenMov=906
; 1002=Переименовать (Shift+F6)
cm_RenameOnly=1002
; 1007=Переименовать файл/каталог под курсором
cm_RenameSingleFile=1007
; 1005=Переместить (F6)
cm_MoveOnly=1005
; 907=Создать каталог
cm_MkDir=907
; 911=Создать каталог в целевой панели
cm_MkDirOther=911
; 908=Удалить файлы
cm_Delete=908
; 1003=Свойства (Суммарный размер)
cm_Properties=1003
; 1008=Открыть диалог 'Поделиться' (Windows 10)
cm_ModernShare=1008
; 1004=Создать ярлык
cm_CreateShortcut=1004
; 502=Изменить атрибуты
cm_SetAttrib=502
; 1001=Программный аналог нажатия Enter
cm_Return=1001
; 2800=Запуск программы от имени другого пользователя
cm_OpenAsUser=2800
; 518=Протестировать архивы
cm_TestArchive=518
; 508=Упаковать файлы
cm_PackFiles=508
; 2955=Упаковать файлы (копирование)
cm_CopyToArchive=2955
; 2956=Упаковать файлы (перемещение)
cm_MoveToArchive=2956
; 509=Распаковать файлы
cm_UnpackFiles=509
; 560=Разбить файл
cm_Split=560
; 561=Собрать файлы
cm_Combine=561
; 562=Кодировать файл (MIME/UUE/XXE)
cm_Encode=562
; 563=Декодировать файл (MIME/UUE/XXE/BinHex)
cm_Decode=563
; 564=Посчитать CRC-суммы (формат CRC32, MD5, SHA1)
cm_CRCcreate=564
; 565=Проверить CRC-суммы (из файлов CRC32, MD5, SHA1)
cm_CRCcheck=565
; 490=Настройка: Вид окна (первая страница)
cm_Config=490
; 476=Настройка: Вид окна
cm_LayoutConfig=476
; 486=Настройка: Содержимое панелей
cm_DisplayConfig=486
; 477=Настройка: Значки
cm_IconConfig=477
; 492=Настройка: Шрифты
cm_FontConfig=492
; 494=Настройка: Цвета
cm_ColorConfig=494
; 497=Настройка: Табуляторы
cm_ConfTabChange=497
; 488=Настройка: Вкладки папок
cm_DirTabsConfig=488
; 483=Настройка: Наборы колонок
cm_CustomColumnConfig=483
; 2920=Настройка: Текущий набор колонок
cm_CustomColumnDlg=2920
; 2939=Настройка: Режимы просмотра
cm_ConfigViewModes=2939
; 2940=Настройка: Автопереключение режимов
cm_ConfigViewModeSwitch=2940
; 499=Настройка: Язык
cm_LanguageConfig=499
; 516=Настройка: Основные операции
cm_Config2=516
; 496=Настройка: Правка/Просмотр
cm_EditConfig=496
; 3036=Настройка: Внутренний просмотрщик
cm_ConfigLister=3036
; 487=Настройка: Операции с файлами
cm_CopyConfig=487
; 478=Настройка: Автообновление
cm_RefreshConfig=478
; 479=Настройка: Быстрый поиск
cm_QuickSearchConfig=479
; 489=Настройка: FTP
cm_FtpConfig=489
; 484=Настройка: Плагины
cm_PluginsConfig=484
; 482=Настройка: Эскизы
cm_ThumbnailsConfig=482
; 481=Настройка: Файл отчёта
cm_LogConfig=481
; 480=Настройка: Список исключений
cm_IgnoreConfig=480
; 475=Настройка: История каталогов
cm_HistoryConfig=475
; 491=Настройка: Архиваторы
cm_PackerConfig=491
; 485=Настройка: Архиватор ZIP
cm_ZipPackerConfig=485
; 495=Настройка: Разное
cm_Confirmation=495
; 493=Сохранить позицию
cm_ConfigSavePos=493
; 498=	Настройка главной панели инструментов
cm_ButtonConfig=498
; 583=Настройка вертикальной панели инструментов
cm_ButtonConfig2=583
; 580=Сохранить настройки
cm_ConfigSaveSettings=580
; 581=Правка файлов конфигурации
cm_ConfigChangeIniFiles=581
; 582=Сохранить историю каталогов
cm_ConfigSaveDirHistory=582
; 700=Настройка меню «Запуск»
cm_ChangeStartMenu=700
; 512=Подключить сетевой диск
cm_NetConnect=512
; 513=Отключить сетевой диск
cm_NetDisconnect=513
; 514=Открыть общий доступ к каталогу
cm_NetShareDir=514
; 515=Закрыть общий доступ к каталогу
cm_NetUnshareDir=515
; 2204=Показать ресурсы администратора (\\server\c$ и пр.)
cm_AdministerServer=2204
; 2203=Показать, кем открыт файл по сети
cm_ShowFileUser=2203
; 503=Подсчитать занимаемое место
cm_GetFileSpace=503
; 2014=Подсчёт размеров подкаталогов текущего каталога
cm_CountDirContent=2014
; 505=Метка диска
cm_VolumeId=505
; 510=Свойства (Информация о версии)
cm_VersionInfo=510
; 533=Сравнить каталоги
cm_CompareDirs=533
; 536=Сравнить каталоги с учётом подкаталогов
cm_CompareDirsWithSubdirs=536
; 534=Сравнить каталоги, скрыв одинаковые файлы
cm_DirMatch=534
; 2600=Синхронная смена каталогов в панелях
cm_SyncChangeDir=2600
; 2500=Показать контекстное меню
cm_ContextMenu=2500
; 3020=Показать контекстное меню текущего диска
cm_DriveContextMenu=3020
; 2927=Показать контекстное меню внутренних ассоциаций
cm_ContextMenuInternal=2927
; 2928=Меню внутренних ассоциаций для файла под курсором
cm_ContextMenuInternalCursor=2928
; 2930=Меню команд для управления TC с ПДУ Media Center
cm_ShowRemoteMenu=2930
; 2700=Правка комментария к файлу
cm_EditComment=2700
; 4001=Поместить курсор в левую панель
cm_FocusLeft=4001
; 4002=Поместить курсор в правую панель
cm_FocusRight=4002
; 4004=Установить фокус на панель инструментов
cm_FocusButtonBar=4004
; 531=Поменять местами панели (активные вкладки)
cm_Exchange=531
; 532=Получатель = Источнику
cm_MatchSrc=532
; 2918=Обновить выбранные эскизы
cm_ReloadSelThumbs=2918
; 2945=Обновить кеш иконок баров и меню
cm_ReloadBarIcons=2945
; 650=Проверка наличия новых версий
cm_CheckForUpdates=650
; 2958=Обновить обычные и оверлейные значки в файловых панелях
cm_ReloadFileIcons=2958
; 2913=Выгрузить все плагины
cm_UnloadPlugins=2913
; 2300=Установить соединение через LPT/USB-порт
cm_DirectCableConnect=2300
; 2301=Установить драйвер LPT (NT)
cm_NTinstallDriver=2301
; 2302=Удалить драйвер LPT (NT)
cm_NTremoveDriver=2302
; 2027=Печать списка файлов
cm_PrintDir=2027
; 2028=Печать списка файлов с подкаталогами
cm_PrintDirSub=2028
; 504=Печать содержимого файла
cm_PrintFile=504
; 521=Выделить группу (диалог)
cm_SpreadSelection=521
; 546=Выделить группу (диалог) внести расширение под курсором
cm_SpreadSelectionCurrentExt=546
; 547=Снять выделение с группы (диалог) внести расширение под курсором
cm_ShrinkSelectionCurrentExt=547
; 3311=Выделить группу: файлы и папки
cm_SelectBoth=3311
; 3312=Выделить группу: только файлы
cm_SelectFiles=3312
; 3313=Выделить группу: только папки
cm_SelectFolders=3313
; 522=Снять выделение
cm_ShrinkSelection=522
; 3314=Снять выделение: только файлы
cm_ClearFiles=3314
; 3315=Снять выделение: только папки
cm_ClearFolders=3315
; 3316=Снять выделение (файлы или всё – как настроено)
cm_ClearSelCfg=3316
; 523=Выделить всё (или только файлы – как настроено)
cm_SelectAll=523
; 3301=Выделить всё: файлы и папки
cm_SelectAllBoth=3301
; 3302=Выделить все файлы
cm_SelectAllFiles=3302
; 3303=Выделить все папки
cm_SelectAllFolders=3303
; 524=Снять всё выделение (файлы и папки)
cm_ClearAll=524
; 3304=Снять выделение со всех файлов
cm_ClearAllFiles=3304
; 3305=Снять выделение со всех папок
cm_ClearAllFolders=3305
; 3306=Снять всё выделение (файлы или всё – как настроено)
cm_ClearAllCfg=3306
; 525=Инвертировать выделение
cm_ExchangeSelection=525
; 3321=Инвертировать выделение (файлы и папки)
cm_ExchangeSelBoth=3321
; 3322=Инвертировать выделение (файлы)
cm_ExchangeSelFiles=3322
; 3323=Инвертировать выделение (папки)
cm_ExchangeSelFolders=3323
; 527=Выделить файлы/папки по текущему расширению
cm_SelectCurrentExtension=527
; 528=Снять выделение по текущему расширению
cm_UnselectCurrentExtension=528
; 541=Выделить все файлы по текущему имени
cm_SelectCurrentName=541
; 542=Снять выделение по текущему имени
cm_UnselectCurrentName=542
; 543=Выделить все файлы по текущему имени+расширению
cm_SelectCurrentNameExt=543
; 544=Снять выделение по текущему имени+расширению
cm_UnselectCurrentNameExt=544
; 537=Выделить всё с этим путём (поиск и режим без подкаталогов)
cm_SelectCurrentPath=537
; 538=Снять всё выделение с этим путём
cm_UnselectCurrentPath=538
; 529=Восстановить выделение
cm_RestoreSelection=529
; 530=Временно сохранить выделение
cm_SaveSelection=530
; 2031=Сохранить выделение в файл
cm_SaveSelectionToFile=2031
; 2041=Сохранить выделение в файл (ANSI)
cm_SaveSelectionToFileA=2041
; 2042=Сохранить выделение в файл (Юникод)
cm_SaveSelectionToFileW=2042
; 2039=Сохранить содержимое всех колонок в файл
cm_SaveDetailsToFile=2039
; 2043=Сохранить содержимое всех колонок в файл (ANSI)
cm_SaveDetailsToFileA=2043
; 2044=Сохранить содержимое всех колонок в файл (Юникод)
cm_SaveDetailsToFileW=2044
; 2093=Сохранить выделение (все колонки с заголовками) в файл
cm_SaveHdrDetailsToFile=2093
; 2094=Сохранить выделение (все колонки с заголовками) в файл (ANSI)
cm_SaveHdrDetailsToFileA=2094
; 2095=Сохранить выделение (все колонки с заголовками) в файл (Юникод)
cm_SaveHdrDetailsToFileW=2095
; 2090=Копировать содержимое всех колонок с заголовками
cm_CopyHdrFileDetailsToClip=2090
; 2091=Копировать все колонки с заголовками (полные пути)
cm_CopyHdrFpFileDetailsToClip=2091
; 2092=Копировать все колонки с заголовками (UNC-пути)
cm_CopyHdrNetFileDetailsToClip=2092
; 2032=Загрузить выделение из файла
cm_LoadSelectionFromFile=2032
; 2033=Загрузить выделение из буфера
cm_LoadSelectionFromClip=2033
; 2936=Выделение объекта с переходом на следующий
cm_Select=2936
; 2937=Снять выделение с объекта с переходом на следующий
cm_UnSelect=2937
; 2938=Выделение или снятие выделения с объекта с переходом на следующий
cm_Reverse=2938
; 2200=Изменение прав доступа (NTFS)
cm_EditPermissionInfo=2200
; 2201=Аудит файлов (NTFS)
cm_EditAuditInfo=2201
; 2202=Стать владельцем (NTFS)
cm_EditOwnerInfo=2202
; 2007=Вырезать файлы в буфер
cm_CutToClipboard=2007
; 2008=Копировать файлы в буфер
cm_CopyToClipboard=2008
; 2009=Вставить файлы из буфера
cm_PasteFromClipboard=2009
; 2017=Копировать в буфер имена файлов
cm_CopyNamesToClip=2017
; 2018=Копировать в буфер имена с путями
cm_CopyFullNamesToClip=2018
; 2021=Копировать в буфер имена с UNC-путём
cm_CopyNetNamesToClip=2021
; 3035=Копировать в буфер полные пути к родительским каталогам
cm_CopyPathOfFilesToClip=3035
; 2029=Копировать в буфер путь источника
cm_CopySrcPathToClip=2029
; 2030=Копировать в буфер путь получателя
cm_CopyTrgPathToClip=2030
; 2036=Копировать содержимое всех колонок
cm_CopyFileDetailsToClip=2036
; 2037=Копировать все колонки (полные пути)
cm_CopyFpFileDetailsToClip=2037
; 2038=Копировать все колонки (UNC-пути)
cm_CopyNetFileDetailsToClip=2038
; 550=Соединиться с FTP-сервером
cm_FtpConnect=550
; 551=Новое FTP-соединение
cm_FtpNew=551
; 552=Разорвать FTP-соединение
cm_FtpDisconnect=552
; 553=Показывать скрытые файлы на сервере
cm_FtpHiddenFiles=553
; 554=Прервать текущую FTP-команду
cm_FtpAbort=554
; 555=Возобновить прерванную загрузку
cm_FtpResumeDownload=555
; 556=Выбор режима Авто/Двоичный/Текстовый
cm_FtpSelectTransferMode=556
; 557=Добавить выбранные файлы в список загрузки
cm_FtpAddToList=557
; 558=FTP-загрузка по списку
cm_FtpDownloadList=558
; 570=Назад
cm_GotoPreviousDir=570
; 571=Вперёд
cm_GotoNextDir=571
; 573=Назад с пропуском FTP
cm_GotoPreviousLocalDir=573
; 574=Вперёд с пропуском FTP
cm_GotoNextLocalDir=574
; 500=Дерево каталогов
cm_CDtree=500
; 2912=Редактировать путь в заголовке панели
cm_EditPath=2912
; 572=История каталогов
cm_DirectoryHistory=572
; 575=История каталогов без прореживания
cm_DirectoryHistoryNoThinning=575
; 526=Избранные каталоги
cm_DirectoryHotlist=526
; 2024=Каталог под курсором открыть в левой панели
cm_TransferLeft=2024
; 2025=Каталог под курсором открыть в правой панели
cm_TransferRight=2025
; 2001=Перейти в корневой каталог
cm_GoToRoot=2001
; 2002=Перейти в родительский каталог
cm_GoToParent=2002
; 2003=Открыть каталог/архив под курсором
cm_GoToDir=2003
; 2050=Поместить курсор на первый файл в списке
cm_GoToFirstFile=2050
; 2049=Поместить курсор на первый объект в списке
cm_GoToFirstEntry=2049
; 2053=Перейти к следующему выделенному файлу
cm_GotoNextSelected=2053
; 2054=Перейти к предыдущему выделенному файлу
cm_GotoPrevSelected=2054
; 2055 - Поместить курсор на следующий объект
cm_GotoNext=2055
; 2056 - Поместить курсор на предыдущий объект
cm_GotoPrev=2056
; 2057=Поместить курсор на последний объект в списке
cm_GoToLast=2057
; 2121=Рабочий стол
cm_OpenDesktop=2121
; 2122=Мой компьютер
cm_OpenDrives=2122
; 2123=Панель управления
cm_OpenControls=2123
; 2124=Шрифты
cm_OpenFonts=2124
; 2125=Сетевое окружение
cm_OpenNetwork=2125
; 2126=Принтеры
cm_OpenPrinters=2126
; 2127=Корзина
cm_OpenRecycled=2127
; 2051=Перейти к следующему диску (C–>D)
cm_GotoNextDrive=2051
; 2052=Перейти к предыдущему диску (C<–D)
cm_GotoPreviousDrive=2052
; 2061=Переключиться на диск A
cm_GotoDriveA=2061
; 2062=Переключиться на диск B
cm_GotoDriveB=2062
; 2063=Переключиться на диск C
cm_GotoDriveC=2063
; 2064=Переключиться на диск D
cm_GotoDriveD=2064
; 2065=Переключиться на диск E
cm_GotoDriveE=2065
; 2066=Переключиться на диск F
cm_GotoDriveF=2066
; 2067=Переключиться на диск G
cm_GotoDriveG=2067
; 2068=Переключиться на диск H
cm_GotoDriveH=2068
; 2069=Переключиться на диск I
cm_GotoDriveI=2069
; 2070=Переключиться на диск J
cm_GotoDriveJ=2070
; 2071=Переключиться на диск K
cm_GotoDriveK=2071
; 2072=Переключиться на диск L
cm_GotoDriveL=2072
; 2073=Переключиться на диск M
cm_GotoDriveM=2073
; 2074=Переключиться на диск N
cm_GotoDriveN=2074
; 2075=Переключиться на диск O
cm_GotoDriveO=2075
; 2076=Переключиться на диск P
cm_GotoDriveP=2076
; 2077=Переключиться на диск Q
cm_GotoDriveQ=2077
; 2078=Переключиться на диск R
cm_GotoDriveR=2078
; 2079=Переключиться на диск S
cm_GotoDriveS=2079
; 2080=Переключиться на диск T
cm_GotoDriveT=2080
; 2081=Переключиться на диск U
cm_GotoDriveU=2081
; 2082=Переключиться на диск V
cm_GotoDriveV=2082
; 2083=Переключиться на диск W
cm_GotoDriveW=2083
; 2084=Переключиться на диск X
cm_GotoDriveX=2084
; 2085=Переключиться на диск Y
cm_GotoDriveY=2085
; 2086=Переключиться на диск Z
cm_GotoDriveZ=2086
; 610=Справка (содержание)
cm_HelpIndex=610
; 620=Справка по горячим клавишам
cm_Keyboard=620
; 630=Информация о регистрации
cm_Register=630
; 640=Посетить сайт Total Commander
cm_VisitHomepage=640
; 690=О программе Total Commander
cm_About=690
; 24340=Выход из Total Commander
cm_Exit=24340
; 2000=Свернуть окно Total Commander
cm_Minimize=2000
; 2015=Развернуть окно Total Commander
cm_Maximize=2015
; 2016=Восстановить окно Total Commander
cm_Restore=2016
; 511=Открыть командную консоль
cm_ExecuteDOS=511
; 4003=Поместить курсор в командную строку
cm_FocusCmdLine=4003
; 4005=Поместить курсор в активную панель
cm_FocusSrc=4005
; 4006=Поместить курсор в другую панель
cm_FocusTrg=4006
; 4007=Поместить курсор в левое дерево
cm_FocusLeftTree=4007
; 4008=Поместить курсор в правое дерево
cm_FocusRightTree=4008
; 4009=Поместить курсор в активное дерево
cm_FocusSrcTree=4009
; 4010=Поместить курсор в другое дерево
cm_FocusTrgTree=4010
; 4011=Установить фокус в главное меню
cm_FocusMainMenu=4011
; 4012=Установить фокус на вертикальную панель инструментов
cm_FocusButtonBarVertical=4012
; 2004=Очистить командную строку
cm_ClearCmdLine=2004
; 2005=Следующая сохранённая команда
cm_NextCommand=2005
; 2006=Предыдущая сохранённая команда
cm_PrevCommand=2006
; 2019=Добавить текущий путь в командную строку
cm_AddPathToCmdline=2019
; 3021=Добавить имя объекта в командную строку
cm_AddFileNameToCmdline=3021
; 3022=Добавить полный путь объекта в командную строку
cm_AddPathAndFileNameToCmdline=3022
; 3023=Открыть/Закрыть историю командной строки
cm_ShowCmdLineHistory=3023
; 2400=Групповое переименование
cm_MultiRenameFiles=2400
; 501=Поиск файлов
cm_SearchFor=501
; 517=Поиск файлов в каталоге под курсором
cm_SearchForInCurdir=517
; 545=Поиск файлов в фоновом режиме, в отдельном процессе
cm_SearchStandalone=545
; 519=Настройка внутренних ассоциаций
cm_InternalAssociate=519
; 507=Открыть с помощью... (Файловые ассоциации)
cm_Associate=507
; 2924=Список внутренних и пользовательских команд
cm_CommandBrowser=2924
; 506=Информация о системе
cm_SysInfo=506
; 559=Диспетчер фоновой пересылки
cm_OpenTransferManager=559
; 2020=Синхронизировать каталоги
cm_FileSync=2020
; 2022=Сравнить файлы по содержимому
cm_CompareFilesByContent=2022
; 2040=Сравнить внутренним инструментом
cm_IntCompareFilesByContent=2040
; 2941=Сравнить внутренним инструментом
cm_SeparateQuickView=2941
; 2942=Отдельное окно быстрого просмотра без плагинов
cm_SeparateQuickInternalOnly=2942
; 2946=Обновить файл в текущем режиме быстрого просмотра
cm_UpdateQuickView=2946
; 2901=Отдельное окно быстрого просмотра
cm_VisButtonbar=2901
; 2944=Вертикальную панель инструментов: вкл/выкл
cm_VisButtonbar2=2944
; 2902=Кнопки дисков: вкл/выкл
cm_VisDriveButtons=2902
; 2903=Панели выбора дисков: две/одна
cm_VisTwoDriveButtons=2903
; 2904=Кнопки дисков: плоские/обычные
cm_VisFlatDriveButtons=2904
; 2905=Интерфейс основного окна: плоский/обычный
cm_VisFlatInterface=2905
; 2906=Окно выбора диска: вкл/выкл
cm_VisDriveCombo=2906
; 2907=Заголовок файловой панели: вкл/выкл
cm_VisCurDir=2907
; 2926=Цепочки навигации: вкл/выкл
cm_VisBreadCrumbs=2926
; 2908=Заголовки табуляторов: вкл/выкл
cm_VisTabHeader=2908
; 2909=Строка состояния: вкл/выкл
cm_VisStatusbar=2909
; 2910=Командная строка: вкл/выкл
cm_VisCmdLine=2910
; 2911=Функциональные кнопки: вкл/выкл
cm_VisKeyButtons=2911
; 2914=Показать подсказку для файла
cm_ShowHint=2914
; 2915=Вывести диалог быстрого поиска/фильтрации
cm_ShowQuickSearch=2915
; 3018=Вывести диалог быстрого поиска
cm_QuickSearch=3018
; 3019=Вывести диалог быстрой фильтрации
cm_QuickFilter=3019
; 2010=Показывать длинные имена: вкл/выкл
cm_SwitchLongNames=2010
; 540=Обновить содержимое панели
cm_RereadSource=540
; 2023=Показать только выделенные объекты
cm_ShowOnlySelected=2023
; 2011=Показ скрытых/системных файлов: вкл/выкл
cm_SwitchHidSys=2011
; 3013=Показ скрытых файлов: вкл/выкл
cm_SwitchHid=3013
; 3014=Показ системных файлов: вкл/выкл
cm_SwitchSys=3014
; 2013=Имена формата 8.3 в нижнем регистре: вкл/выкл
cm_Switch83Names=2013
; 2012=Сортировать каталоги: по имени/как файлы
cm_SwitchDirSort=2012
; 2026=Показать все файлы без подкаталогов
cm_DirBranch=2026
; 2046=Показать все файлы без подкаталогов (только в выделенном)
cm_DirBranchSel=2046
; 909=Установить размеры панелей одинаковыми
cm_50Percent=909
; 910=Скрыть неактивную панель (можно использовать cm_100Percent 70 или cm_100Percent 10 ... для перемещения сепаратора)
cm_100Percent=910
; 2916=Использовать вкладки папок: вкл/выкл
cm_VisDirTabs=2916
; 2923=Стиль Windows XP/Vista/7 для фона: вкл/выкл
cm_VisXPThemeBackground=2923
; 2917=Показывать оверлейные значки: вкл/выкл
cm_SwitchOverlayIcons=2917
; 2919=Кнопки истории и избранных каталогов: вкл/выкл
cm_VisHistHotButtons=2919
; 2921=Слежение за каталогами: вкл/выкл
cm_SwitchWatchDirs=2921
; 2922=Функция исключений файловых имён: вкл/выкл
cm_SwitchIgnoreList=2922
; 2925=x64: Перенаправление System32->SysWOW64: выкл/вкл
cm_SwitchX64Redirection=2925
; 3200=Не показывать дерево в отдельной панели
cm_SeparateTreeOff=3200
; 3201=Одиночное дерево в отдельной панели
cm_SeparateTree1=3201
; 3202=Два дерева в отдельных панелях
cm_SeparateTree2=3202
; 3203=Выбор режима дерева в отдельной панели (0/1/2)
cm_SwitchSeparateTree=3203
; 3204=Одиночное дерево в отдельной панели: вкл/выкл
cm_ToggleSeparateTree1=3204
; 3205=Два дерева в отдельных панелях: вкл/выкл
cm_ToggleSeparateTree2=3205
; 2948=Меню выбора кодировки имён в архиве
cm_ChangeArchiveEncoding=2948
; 2950=Тёмный режим: вкл/выкл
cm_SwitchDarkmode=2950
; 2951=Включить тёмный режим
cm_EnableDarkmode=2951
; 2952=Выключить тёмный режим
cm_DisableDarkmode=2952
; 2957=Цвета для типов файлов: вкл/выкл
cm_SwitchColorsByFileType=2957
; 2959=Всплывающие подсказки: вкл/выкл
cm_SwitchFileTipWindows=2959
; 2953=Увеличить эскизы (максимум 200%)
cm_ZoomIn=2953
; 2954=Уменьшить эскизы (минимум 10%)
cm_ZoomOut=2954
; cm_Ziro=используется в главном меню в сборке TC IMAGE
cm_Ziro=554
; 3001=Открыть новую вкладку
cm_OpenNewTab=3001
; 3002=Открыть вкладку в фоне
cm_OpenNewTabBg=3002
; 3027=Открыть копию текущей вкладки на другой панели
cm_OpenNewTabOther=3027
; 3028=Открыть копию текущей вкладки в фоне на другой панели
cm_OpenNewTabBgOther=3028
; 3003=Открыть папку под курсором в новой вкладке
cm_OpenDirInNewTab=3003
; 3004=Открыть папку под курсором в другой панели
cm_OpenDirInNewTabOther=3004
; 3005=Переключиться на следующую вкладку
cm_SwitchToNextTab=3005
; 3006=Переключиться на предыдущую вкладку
cm_SwitchToPreviousTab=3006
; 3015=Переместить текущую вкладку влево
cm_MoveTabLeft=3015
; 3016=Переместить текущую вкладку вправо
cm_MoveTabRight=3016
; 3007=Закрыть вкладку
cm_CloseCurrentTab=3007
; 3008=Закрыть все вкладки
cm_CloseAllTabs=3008
; 3017=Закрыть дубликаты вкладок (текущая панель)
cm_CloseDuplicateTabs=3017
; 3009=Показать меню вкладки
cm_DirTabsShowMenu=3009
; 3024=Переименование и/или блокировка вкладки
cm_RenameTab=3024
; 3010=Заблокировать/Разблокировать вкладку
cm_ToggleLockCurrentTab=3010
; 3012=Заблокировать/Разблокировать вкладку с возможностью смены каталога
cm_ToggleLockDcaCurrentTab=3012
; 3029=Разблокировать вкладку
cm_SetTabOptionNormal=3029
; 3030=Заблокировать вкладку
cm_SetTabOptionPathLocked=3030
; 3031=Заблокировать вкладку с возможностью смены каталога
cm_SetTabOptionPathResets=3031
; 3032=Разблокировать все вкладки текущей панели
cm_SetAllTabsOptionNormal=3032
; 3033=Заблокировать все вкладки текущей панели
cm_SetAllTabsOptionPathLocked=3033
; 3034=Заблокировать все вкладки текущей панели с возможностью смены каталога
cm_SetAllTabsOptionPathResets=3034
; 535=Поменять местами панели (все вкладки)
cm_ExchangeWithTabs=535
; 3011=Перейти в корень заблокированной вкладки
cm_GoToLockedDir=3011
; 5501=Активная: Следующий набор колонок
cm_SrcNextCustomView=5501
; 5502=Активная: Предыдущий набор колонок
cm_SrcPrevCustomView=5502
; 5503=Неактивная: Следующий набор колонок
cm_TrgNextCustomView=5503
; 5504=Неактивная: Предыдущий набор колонок
cm_TrgPrevCustomView=5504
; 5505=Левая: Следующий набор колонок
cm_LeftNextCustomView=5505
; 5506=Левая: Предыдущий набор колонок
cm_LeftPrevCustomView=5506
; 5507=Правая: Следующий набор колонок
cm_RightNextCustomView=5507
; 5508=Правая: Предыдущий набор колонок
cm_RightPrevCustomView=5508
; 5512=Поля по запросу: Загрузить для всех файлов
cm_LoadAllOnDemandFields=5512
; 5513=Поля по запросу: Загрузить для выбранных файлов
cm_LoadSelOnDemandFields=5513
; 5514=Поля по запросу: Остановить загрузку
cm_ContentStopLoadFields=5514
; 5510=[для скриптов] Левая: Переключить набор колонок (lparam=номер)
cm_LeftSwitchToThisCustomView=5510
; 5511=[для скриптов] Правая: Переключить набор колонок (lparam=номер)
cm_RightSwitchToThisCustomView=5511

; 701=Запустить первый пункт меню «Запуск» ; ; 898=198-й пункт меню «Запуск»
cm_UserMenu1=701
cm_UserMenu2=702
cm_UserMenu3=703
cm_UserMenu4=704
cm_UserMenu5=705
cm_UserMenu6=706
cm_UserMenu7=707
cm_UserMenu8=708
cm_UserMenu9=709
cm_UserMenu10=710
cm_UserMenu11=711
cm_UserMenu12=712
cm_UserMenu13=713
cm_UserMenu14=714
cm_UserMenu15=715
cm_UserMenu16=716
cm_UserMenu17=717
cm_UserMenu18=718
cm_UserMenu19=719
cm_UserMenu20=720
cm_UserMenu21=721
cm_UserMenu22=722
cm_UserMenu23=723
cm_UserMenu24=724
cm_UserMenu25=725
cm_UserMenu26=726
cm_UserMenu27=727
cm_UserMenu28=728
cm_UserMenu29=729
cm_UserMenu30=730
cm_UserMenu31=731
cm_UserMenu32=732
cm_UserMenu33=733
cm_UserMenu34=734
cm_UserMenu35=735
cm_UserMenu36=736
cm_UserMenu37=737
cm_UserMenu38=738
cm_UserMenu39=739
cm_UserMenu40=740
cm_UserMenu41=741
cm_UserMenu42=742
cm_UserMenu43=743
cm_UserMenu44=744
cm_UserMenu45=745
cm_UserMenu46=746
cm_UserMenu47=747
cm_UserMenu48=748
cm_UserMenu49=749
cm_UserMenu50=750
cm_UserMenu51=751
cm_UserMenu52=752
cm_UserMenu53=753
cm_UserMenu54=754
cm_UserMenu55=755
cm_UserMenu56=756
cm_UserMenu57=757
cm_UserMenu58=758
cm_UserMenu59=759
cm_UserMenu60=760
cm_UserMenu61=761
cm_UserMenu62=762
cm_UserMenu63=763
cm_UserMenu64=764
cm_UserMenu65=765
cm_UserMenu66=766
cm_UserMenu67=767
cm_UserMenu68=768
cm_UserMenu69=769
cm_UserMenu70=770
cm_UserMenu71=771
cm_UserMenu72=772
cm_UserMenu73=773
cm_UserMenu74=774
cm_UserMenu75=775
cm_UserMenu76=776
cm_UserMenu77=777
cm_UserMenu78=778
cm_UserMenu79=779
cm_UserMenu80=780
cm_UserMenu81=781
cm_UserMenu82=782
cm_UserMenu83=783
cm_UserMenu84=784
cm_UserMenu85=785
cm_UserMenu86=786
cm_UserMenu87=787
cm_UserMenu88=788
cm_UserMenu89=789
cm_UserMenu90=790
cm_UserMenu91=791
cm_UserMenu92=792
cm_UserMenu93=793
cm_UserMenu94=794
cm_UserMenu95=795
cm_UserMenu96=796
cm_UserMenu97=797
cm_UserMenu98=798
cm_UserMenu99=799
cm_UserMenu100=800
cm_UserMenu101=801
cm_UserMenu102=802
cm_UserMenu103=803
cm_UserMenu104=804
cm_UserMenu105=805
cm_UserMenu106=806
cm_UserMenu107=807
cm_UserMenu108=808
cm_UserMenu109=809
cm_UserMenu110=810
cm_UserMenu111=811
cm_UserMenu112=812
cm_UserMenu113=813
cm_UserMenu114=814
cm_UserMenu115=815
cm_UserMenu116=816
cm_UserMenu117=817
cm_UserMenu118=818
cm_UserMenu119=819
cm_UserMenu120=820
cm_UserMenu121=821
cm_UserMenu122=822
cm_UserMenu123=823
cm_UserMenu124=824
cm_UserMenu125=825
cm_UserMenu126=826
cm_UserMenu127=827
cm_UserMenu128=828
cm_UserMenu129=829
cm_UserMenu130=830
cm_UserMenu131=831
cm_UserMenu132=832
cm_UserMenu133=833
cm_UserMenu134=834
cm_UserMenu135=835
cm_UserMenu136=836
cm_UserMenu137=837
cm_UserMenu138=838
cm_UserMenu139=839
cm_UserMenu140=840
cm_UserMenu141=841
cm_UserMenu142=842
cm_UserMenu143=843
cm_UserMenu144=844
cm_UserMenu145=845
cm_UserMenu146=846
cm_UserMenu147=847
cm_UserMenu148=848
cm_UserMenu149=849
cm_UserMenu150=850
cm_UserMenu151=851
cm_UserMenu152=852
cm_UserMenu153=853
cm_UserMenu154=854
cm_UserMenu155=855
cm_UserMenu156=856
cm_UserMenu157=857
cm_UserMenu158=858
cm_UserMenu159=859
cm_UserMenu160=860
cm_UserMenu161=861
cm_UserMenu162=862
cm_UserMenu163=863
cm_UserMenu164=864
cm_UserMenu165=865
cm_UserMenu166=866
cm_UserMenu167=867
cm_UserMenu168=868
cm_UserMenu169=869
cm_UserMenu170=870
cm_UserMenu171=871
cm_UserMenu172=872
cm_UserMenu173=873
cm_UserMenu174=874
cm_UserMenu175=875
cm_UserMenu176=876
cm_UserMenu177=877
cm_UserMenu178=878
cm_UserMenu179=879
cm_UserMenu180=880
cm_UserMenu181=881
cm_UserMenu182=882
cm_UserMenu183=883
cm_UserMenu184=884
cm_UserMenu185=885
cm_UserMenu186=886
cm_UserMenu187=887
cm_UserMenu188=888
cm_UserMenu189=889
cm_UserMenu190=890
cm_UserMenu191=891
cm_UserMenu192=892
cm_UserMenu193=893
cm_UserMenu194=894
cm_UserMenu195=895
cm_UserMenu196=896
cm_UserMenu197=897
cm_UserMenu198=898
; 5001=Сделать активной первую вкладку (активная панель) 5099=Сделать активной 99-ю вкладку
cm_SrcActivateTab1=5001
cm_SrcActivateTab2=5002
cm_SrcActivateTab3=5003
cm_SrcActivateTab4=5004
cm_SrcActivateTab5=5005
cm_SrcActivateTab6=5006
cm_SrcActivateTab7=5007
cm_SrcActivateTab8=5008
cm_SrcActivateTab9=5009
cm_SrcActivateTab10=5010
cm_SrcActivateTab11=5011
cm_SrcActivateTab12=5012
cm_SrcActivateTab13=5013
cm_SrcActivateTab14=5014
cm_SrcActivateTab15=5015
cm_SrcActivateTab16=5016
cm_SrcActivateTab17=5017
cm_SrcActivateTab18=5018
cm_SrcActivateTab19=5019
cm_SrcActivateTab20=5020
cm_SrcActivateTab21=5021
cm_SrcActivateTab22=5022
cm_SrcActivateTab23=5023
cm_SrcActivateTab24=5024
cm_SrcActivateTab25=5025
cm_SrcActivateTab26=5026
cm_SrcActivateTab27=5027
cm_SrcActivateTab28=5028
cm_SrcActivateTab29=5029
cm_SrcActivateTab30=5030
cm_SrcActivateTab31=5031
cm_SrcActivateTab32=5032
cm_SrcActivateTab33=5033
cm_SrcActivateTab34=5034
cm_SrcActivateTab35=5035
cm_SrcActivateTab36=5036
cm_SrcActivateTab37=5037
cm_SrcActivateTab38=5038
cm_SrcActivateTab39=5039
cm_SrcActivateTab40=5040
cm_SrcActivateTab41=5041
cm_SrcActivateTab42=5042
cm_SrcActivateTab43=5043
cm_SrcActivateTab44=5044
cm_SrcActivateTab45=5045
cm_SrcActivateTab46=5046
cm_SrcActivateTab47=5047
cm_SrcActivateTab48=5048
cm_SrcActivateTab49=5049
cm_SrcActivateTab50=5050
cm_SrcActivateTab51=5051
cm_SrcActivateTab52=5052
cm_SrcActivateTab53=5053
cm_SrcActivateTab54=5054
cm_SrcActivateTab55=5055
cm_SrcActivateTab56=5056
cm_SrcActivateTab57=5057
cm_SrcActivateTab58=5058
cm_SrcActivateTab59=5059
cm_SrcActivateTab60=5060
cm_SrcActivateTab61=5061
cm_SrcActivateTab62=5062
cm_SrcActivateTab63=5063
cm_SrcActivateTab64=5064
cm_SrcActivateTab65=5065
cm_SrcActivateTab66=5066
cm_SrcActivateTab67=5067
cm_SrcActivateTab68=5068
cm_SrcActivateTab69=5069
cm_SrcActivateTab70=5070
cm_SrcActivateTab71=5071
cm_SrcActivateTab72=5072
cm_SrcActivateTab73=5073
cm_SrcActivateTab74=5074
cm_SrcActivateTab75=5075
cm_SrcActivateTab76=5076
cm_SrcActivateTab77=5077
cm_SrcActivateTab78=5078
cm_SrcActivateTab79=5079
cm_SrcActivateTab80=5080
cm_SrcActivateTab81=5081
cm_SrcActivateTab82=5082
cm_SrcActivateTab83=5083
cm_SrcActivateTab84=5084
cm_SrcActivateTab85=5085
cm_SrcActivateTab86=5086
cm_SrcActivateTab87=5087
cm_SrcActivateTab88=5088
cm_SrcActivateTab89=5089
cm_SrcActivateTab90=5090
cm_SrcActivateTab91=5091
cm_SrcActivateTab92=5092
cm_SrcActivateTab93=5093
cm_SrcActivateTab94=5094
cm_SrcActivateTab95=5095
cm_SrcActivateTab96=5096
cm_SrcActivateTab97=5097
cm_SrcActivateTab98=5098
cm_SrcActivateTab99=5099
; 5001=Сделать активной первую вкладку (неактивная панель) 5199=Сделать активной 99-ю вкладку
cm_TrgActivateTab1=5101
cm_TrgActivateTab2=5102
cm_TrgActivateTab3=5103
cm_TrgActivateTab4=5104
cm_TrgActivateTab5=5105
cm_TrgActivateTab6=5106
cm_TrgActivateTab7=5107
cm_TrgActivateTab8=5108
cm_TrgActivateTab9=5109
cm_TrgActivateTab10=5110
cm_TrgActivateTab11=5111
cm_TrgActivateTab12=5112
cm_TrgActivateTab13=5113
cm_TrgActivateTab14=5114
cm_TrgActivateTab15=5115
cm_TrgActivateTab16=5116
cm_TrgActivateTab17=5117
cm_TrgActivateTab18=5118
cm_TrgActivateTab19=5119
cm_TrgActivateTab20=5120
cm_TrgActivateTab21=5121
cm_TrgActivateTab22=5122
cm_TrgActivateTab23=5123
cm_TrgActivateTab24=5124
cm_TrgActivateTab25=5125
cm_TrgActivateTab26=5126
cm_TrgActivateTab27=5127
cm_TrgActivateTab28=5128
cm_TrgActivateTab29=5129
cm_TrgActivateTab30=5130
cm_TrgActivateTab31=5131
cm_TrgActivateTab32=5132
cm_TrgActivateTab33=5133
cm_TrgActivateTab34=5134
cm_TrgActivateTab35=5135
cm_TrgActivateTab36=5136
cm_TrgActivateTab37=5137
cm_TrgActivateTab38=5138
cm_TrgActivateTab39=5139
cm_TrgActivateTab40=5140
cm_TrgActivateTab41=5141
cm_TrgActivateTab42=5142
cm_TrgActivateTab43=5143
cm_TrgActivateTab44=5144
cm_TrgActivateTab45=5145
cm_TrgActivateTab46=5146
cm_TrgActivateTab47=5147
cm_TrgActivateTab48=5148
cm_TrgActivateTab49=5149
cm_TrgActivateTab50=5150
cm_TrgActivateTab51=5151
cm_TrgActivateTab52=5152
cm_TrgActivateTab53=5153
cm_TrgActivateTab54=5154
cm_TrgActivateTab55=5155
cm_TrgActivateTab56=5156
cm_TrgActivateTab57=5157
cm_TrgActivateTab58=5158
cm_TrgActivateTab59=5159
cm_TrgActivateTab60=5160
cm_TrgActivateTab61=5161
cm_TrgActivateTab62=5162
cm_TrgActivateTab63=5163
cm_TrgActivateTab64=5164
cm_TrgActivateTab65=5165
cm_TrgActivateTab66=5166
cm_TrgActivateTab67=5167
cm_TrgActivateTab68=5168
cm_TrgActivateTab69=5169
cm_TrgActivateTab70=5170
cm_TrgActivateTab71=5171
cm_TrgActivateTab72=5172
cm_TrgActivateTab73=5173
cm_TrgActivateTab74=5174
cm_TrgActivateTab75=5175
cm_TrgActivateTab76=5176
cm_TrgActivateTab77=5177
cm_TrgActivateTab78=5178
cm_TrgActivateTab79=5179
cm_TrgActivateTab80=5180
cm_TrgActivateTab81=5181
cm_TrgActivateTab82=5182
cm_TrgActivateTab83=5183
cm_TrgActivateTab84=5184
cm_TrgActivateTab85=5185
cm_TrgActivateTab86=5186
cm_TrgActivateTab87=5187
cm_TrgActivateTab88=5188
cm_TrgActivateTab89=5189
cm_TrgActivateTab90=5190
cm_TrgActivateTab91=5191
cm_TrgActivateTab92=5192
cm_TrgActivateTab93=5193
cm_TrgActivateTab94=5194
cm_TrgActivateTab95=5195
cm_TrgActivateTab96=5196
cm_TrgActivateTab97=5197
cm_TrgActivateTab98=5198
cm_TrgActivateTab99=5199
; 5201=Сделать активной первую вкладку (левая панель) 5299=Сделать активной 99-ю вкладку
cm_LeftActivateTab1=5201
cm_LeftActivateTab2=5202
cm_LeftActivateTab3=5203
cm_LeftActivateTab4=5204
cm_LeftActivateTab5=5205
cm_LeftActivateTab6=5206
cm_LeftActivateTab7=5207
cm_LeftActivateTab8=5208
cm_LeftActivateTab9=5209
cm_LeftActivateTab10=5210
cm_LeftActivateTab11=5211
cm_LeftActivateTab12=5212
cm_LeftActivateTab13=5213
cm_LeftActivateTab14=5214
cm_LeftActivateTab15=5215
cm_LeftActivateTab16=5216
cm_LeftActivateTab17=5217
cm_LeftActivateTab18=5218
cm_LeftActivateTab19=5219
cm_LeftActivateTab20=5220
cm_LeftActivateTab21=5221
cm_LeftActivateTab22=5222
cm_LeftActivateTab23=5223
cm_LeftActivateTab24=5224
cm_LeftActivateTab25=5225
cm_LeftActivateTab26=5226
cm_LeftActivateTab27=5227
cm_LeftActivateTab28=5228
cm_LeftActivateTab29=5229
cm_LeftActivateTab30=5230
cm_LeftActivateTab31=5231
cm_LeftActivateTab32=5232
cm_LeftActivateTab33=5233
cm_LeftActivateTab34=5234
cm_LeftActivateTab35=5235
cm_LeftActivateTab36=5236
cm_LeftActivateTab37=5237
cm_LeftActivateTab38=5238
cm_LeftActivateTab39=5239
cm_LeftActivateTab40=5240
cm_LeftActivateTab41=5241
cm_LeftActivateTab42=5242
cm_LeftActivateTab43=5243
cm_LeftActivateTab44=5244
cm_LeftActivateTab45=5245
cm_LeftActivateTab46=5246
cm_LeftActivateTab47=5247
cm_LeftActivateTab48=5248
cm_LeftActivateTab49=5249
cm_LeftActivateTab50=5250
cm_LeftActivateTab51=5251
cm_LeftActivateTab52=5252
cm_LeftActivateTab53=5253
cm_LeftActivateTab54=5254
cm_LeftActivateTab55=5255
cm_LeftActivateTab56=5256
cm_LeftActivateTab57=5257
cm_LeftActivateTab58=5258
cm_LeftActivateTab59=5259
cm_LeftActivateTab60=5260
cm_LeftActivateTab61=5261
cm_LeftActivateTab62=5262
cm_LeftActivateTab63=5263
cm_LeftActivateTab64=5264
cm_LeftActivateTab65=5265
cm_LeftActivateTab66=5266
cm_LeftActivateTab67=5267
cm_LeftActivateTab68=5268
cm_LeftActivateTab69=5269
cm_LeftActivateTab70=5270
cm_LeftActivateTab71=5271
cm_LeftActivateTab72=5272
cm_LeftActivateTab73=5273
cm_LeftActivateTab74=5274
cm_LeftActivateTab75=5275
cm_LeftActivateTab76=5276
cm_LeftActivateTab77=5277
cm_LeftActivateTab78=5278
cm_LeftActivateTab79=5279
cm_LeftActivateTab80=5280
cm_LeftActivateTab81=5281
cm_LeftActivateTab82=5282
cm_LeftActivateTab83=5283
cm_LeftActivateTab84=5284
cm_LeftActivateTab85=5285
cm_LeftActivateTab86=5286
cm_LeftActivateTab87=5287
cm_LeftActivateTab88=5288
cm_LeftActivateTab89=5289
cm_LeftActivateTab90=5290
cm_LeftActivateTab91=5291
cm_LeftActivateTab92=5292
cm_LeftActivateTab93=5293
cm_LeftActivateTab94=5294
cm_LeftActivateTab95=5295
cm_LeftActivateTab96=5296
cm_LeftActivateTab97=5297
cm_LeftActivateTab98=5298
cm_LeftActivateTab99=5299
; 5301=Сделать активной первую вкладку (левая панель) 5399=Сделать активной 99-ю вкладку
cm_RightActivateTab1=5301
cm_RightActivateTab2=5302
cm_RightActivateTab3=5303
cm_RightActivateTab4=5304
cm_RightActivateTab5=5305
cm_RightActivateTab6=5306
cm_RightActivateTab7=5307
cm_RightActivateTab8=5308
cm_RightActivateTab9=5309
cm_RightActivateTab10=5310
cm_RightActivateTab11=5311
cm_RightActivateTab12=5312
cm_RightActivateTab13=5313
cm_RightActivateTab14=5314
cm_RightActivateTab15=5315
cm_RightActivateTab16=5316
cm_RightActivateTab17=5317
cm_RightActivateTab18=5318
cm_RightActivateTab19=5319
cm_RightActivateTab20=5320
cm_RightActivateTab21=5321
cm_RightActivateTab22=5322
cm_RightActivateTab23=5323
cm_RightActivateTab24=5324
cm_RightActivateTab25=5325
cm_RightActivateTab26=5326
cm_RightActivateTab27=5327
cm_RightActivateTab28=5328
cm_RightActivateTab29=5329
cm_RightActivateTab30=5330
cm_RightActivateTab31=5331
cm_RightActivateTab32=5332
cm_RightActivateTab33=5333
cm_RightActivateTab34=5334
cm_RightActivateTab35=5335
cm_RightActivateTab36=5336
cm_RightActivateTab37=5337
cm_RightActivateTab38=5338
cm_RightActivateTab39=5339
cm_RightActivateTab40=5340
cm_RightActivateTab41=5341
cm_RightActivateTab42=5342
cm_RightActivateTab43=5343
cm_RightActivateTab44=5344
cm_RightActivateTab45=5345
cm_RightActivateTab46=5346
cm_RightActivateTab47=5347
cm_RightActivateTab48=5348
cm_RightActivateTab49=5349
cm_RightActivateTab50=5350
cm_RightActivateTab51=5351
cm_RightActivateTab52=5352
cm_RightActivateTab53=5353
cm_RightActivateTab54=5354
cm_RightActivateTab55=5355
cm_RightActivateTab56=5356
cm_RightActivateTab57=5357
cm_RightActivateTab58=5358
cm_RightActivateTab59=5359
cm_RightActivateTab60=5360
cm_RightActivateTab61=5361
cm_RightActivateTab62=5362
cm_RightActivateTab63=5363
cm_RightActivateTab64=5364
cm_RightActivateTab65=5365
cm_RightActivateTab66=5366
cm_RightActivateTab67=5367
cm_RightActivateTab68=5368
cm_RightActivateTab69=5369
cm_RightActivateTab70=5370
cm_RightActivateTab71=5371
cm_RightActivateTab72=5372
cm_RightActivateTab73=5373
cm_RightActivateTab74=5374
cm_RightActivateTab75=5375
cm_RightActivateTab76=5376
cm_RightActivateTab77=5377
cm_RightActivateTab78=5378
cm_RightActivateTab79=5379
cm_RightActivateTab80=5380
cm_RightActivateTab81=5381
cm_RightActivateTab82=5382
cm_RightActivateTab83=5383
cm_RightActivateTab84=5384
cm_RightActivateTab85=5385
cm_RightActivateTab86=5386
cm_RightActivateTab87=5387
cm_RightActivateTab88=5388
cm_RightActivateTab89=5389
cm_RightActivateTab90=5390
cm_RightActivateTab91=5391
cm_RightActivateTab92=5392
cm_RightActivateTab93=5393
cm_RightActivateTab94=5394
cm_RightActivateTab95=5395
cm_RightActivateTab96=5396
cm_RightActivateTab97=5397
cm_RightActivateTab98=5398
cm_RightActivateTab99=5399
; 6001=Сортировать по 1-й колонке (активная панель); 6099 - Сортировать по 99-й колонке
cm_SrcSortByCol1=6001
cm_SrcSortByCol2=6002
cm_SrcSortByCol3=6003
cm_SrcSortByCol4=6004
cm_SrcSortByCol5=6005
cm_SrcSortByCol6=6006
cm_SrcSortByCol7=6007
cm_SrcSortByCol8=6008
cm_SrcSortByCol9=6009
cm_SrcSortByCol10=6010
cm_SrcSortByCol11=6011
cm_SrcSortByCol12=6012
cm_SrcSortByCol13=6013
cm_SrcSortByCol14=6014
cm_SrcSortByCol15=6015
cm_SrcSortByCol16=6016
cm_SrcSortByCol17=6017
cm_SrcSortByCol18=6018
cm_SrcSortByCol19=6019
cm_SrcSortByCol20=6020
cm_SrcSortByCol21=6021
cm_SrcSortByCol22=6022
cm_SrcSortByCol23=6023
cm_SrcSortByCol24=6024
cm_SrcSortByCol25=6025
cm_SrcSortByCol26=6026
cm_SrcSortByCol27=6027
cm_SrcSortByCol28=6028
cm_SrcSortByCol29=6029
cm_SrcSortByCol30=6030
cm_SrcSortByCol31=6031
cm_SrcSortByCol32=6032
cm_SrcSortByCol33=6033
cm_SrcSortByCol34=6034
cm_SrcSortByCol35=6035
cm_SrcSortByCol36=6036
cm_SrcSortByCol37=6037
cm_SrcSortByCol38=6038
cm_SrcSortByCol39=6039
cm_SrcSortByCol40=6040
cm_SrcSortByCol41=6041
cm_SrcSortByCol42=6042
cm_SrcSortByCol43=6043
cm_SrcSortByCol44=6044
cm_SrcSortByCol45=6045
cm_SrcSortByCol46=6046
cm_SrcSortByCol47=6047
cm_SrcSortByCol48=6048
cm_SrcSortByCol49=6049
cm_SrcSortByCol50=6050
cm_SrcSortByCol51=6051
cm_SrcSortByCol52=6052
cm_SrcSortByCol53=6053
cm_SrcSortByCol54=6054
cm_SrcSortByCol55=6055
cm_SrcSortByCol56=6056
cm_SrcSortByCol57=6057
cm_SrcSortByCol58=6058
cm_SrcSortByCol59=6059
cm_SrcSortByCol60=6060
cm_SrcSortByCol61=6061
cm_SrcSortByCol62=6062
cm_SrcSortByCol63=6063
cm_SrcSortByCol64=6064
cm_SrcSortByCol65=6065
cm_SrcSortByCol66=6066
cm_SrcSortByCol67=6067
cm_SrcSortByCol68=6068
cm_SrcSortByCol69=6069
cm_SrcSortByCol70=6070
cm_SrcSortByCol71=6071
cm_SrcSortByCol72=6072
cm_SrcSortByCol73=6073
cm_SrcSortByCol74=6074
cm_SrcSortByCol75=6075
cm_SrcSortByCol76=6076
cm_SrcSortByCol77=6077
cm_SrcSortByCol78=6078
cm_SrcSortByCol79=6079
cm_SrcSortByCol80=6080
cm_SrcSortByCol81=6081
cm_SrcSortByCol82=6082
cm_SrcSortByCol83=6083
cm_SrcSortByCol84=6084
cm_SrcSortByCol85=6085
cm_SrcSortByCol86=6086
cm_SrcSortByCol87=6087
cm_SrcSortByCol88=6088
cm_SrcSortByCol89=6089
cm_SrcSortByCol90=6090
cm_SrcSortByCol91=6091
cm_SrcSortByCol92=6092
cm_SrcSortByCol93=6093
cm_SrcSortByCol94=6094
cm_SrcSortByCol95=6095
cm_SrcSortByCol96=6096
cm_SrcSortByCol97=6097
cm_SrcSortByCol98=6098
cm_SrcSortByCol99=6099
; 6101=Сортировать по 1-й колонке (неактивная панель); 6199 - Сортировать по 99-й колонке
cm_TrgSortByCol1=6101
cm_TrgSortByCol2=6102
cm_TrgSortByCol3=6103
cm_TrgSortByCol4=6104
cm_TrgSortByCol5=6105
cm_TrgSortByCol6=6106
cm_TrgSortByCol7=6107
cm_TrgSortByCol8=6108
cm_TrgSortByCol9=6109
cm_TrgSortByCol10=6110
cm_TrgSortByCol11=6111
cm_TrgSortByCol12=6112
cm_TrgSortByCol13=6113
cm_TrgSortByCol14=6114
cm_TrgSortByCol15=6115
cm_TrgSortByCol16=6116
cm_TrgSortByCol17=6117
cm_TrgSortByCol18=6118
cm_TrgSortByCol19=6119
cm_TrgSortByCol20=6120
cm_TrgSortByCol21=6121
cm_TrgSortByCol22=6122
cm_TrgSortByCol23=6123
cm_TrgSortByCol24=6124
cm_TrgSortByCol25=6125
cm_TrgSortByCol26=6126
cm_TrgSortByCol27=6127
cm_TrgSortByCol28=6128
cm_TrgSortByCol29=6129
cm_TrgSortByCol30=6130
cm_TrgSortByCol31=6131
cm_TrgSortByCol32=6132
cm_TrgSortByCol33=6133
cm_TrgSortByCol34=6134
cm_TrgSortByCol35=6135
cm_TrgSortByCol36=6136
cm_TrgSortByCol37=6137
cm_TrgSortByCol38=6138
cm_TrgSortByCol39=6139
cm_TrgSortByCol40=6140
cm_TrgSortByCol41=6141
cm_TrgSortByCol42=6142
cm_TrgSortByCol43=6143
cm_TrgSortByCol44=6144
cm_TrgSortByCol45=6145
cm_TrgSortByCol46=6146
cm_TrgSortByCol47=6147
cm_TrgSortByCol48=6148
cm_TrgSortByCol49=6149
cm_TrgSortByCol50=6150
cm_TrgSortByCol51=6151
cm_TrgSortByCol52=6152
cm_TrgSortByCol53=6153
cm_TrgSortByCol54=6154
cm_TrgSortByCol55=6155
cm_TrgSortByCol56=6156
cm_TrgSortByCol57=6157
cm_TrgSortByCol58=6158
cm_TrgSortByCol59=6159
cm_TrgSortByCol60=6160
cm_TrgSortByCol61=6161
cm_TrgSortByCol62=6162
cm_TrgSortByCol63=6163
cm_TrgSortByCol64=6164
cm_TrgSortByCol65=6165
cm_TrgSortByCol66=6166
cm_TrgSortByCol67=6167
cm_TrgSortByCol68=6168
cm_TrgSortByCol69=6169
cm_TrgSortByCol70=6170
cm_TrgSortByCol71=6171
cm_TrgSortByCol72=6172
cm_TrgSortByCol73=6173
cm_TrgSortByCol74=6174
cm_TrgSortByCol75=6175
cm_TrgSortByCol76=6176
cm_TrgSortByCol77=6177
cm_TrgSortByCol78=6178
cm_TrgSortByCol79=6179
cm_TrgSortByCol80=6180
cm_TrgSortByCol81=6181
cm_TrgSortByCol82=6182
cm_TrgSortByCol83=6183
cm_TrgSortByCol84=6184
cm_TrgSortByCol85=6185
cm_TrgSortByCol86=6186
cm_TrgSortByCol87=6187
cm_TrgSortByCol88=6188
cm_TrgSortByCol89=6189
cm_TrgSortByCol90=6190
cm_TrgSortByCol91=6191
cm_TrgSortByCol92=6192
cm_TrgSortByCol93=6193
cm_TrgSortByCol94=6194
cm_TrgSortByCol95=6195
cm_TrgSortByCol96=6196
cm_TrgSortByCol97=6197
cm_TrgSortByCol98=6198
cm_TrgSortByCol99=6199
; 6201=Сортировать по 1-й колонке (левая панель); 6299 - Сортировать по 99-й колонке
cm_LeftSortByCol1=6201
cm_LeftSortByCol2=6202
cm_LeftSortByCol3=6203
cm_LeftSortByCol4=6204
cm_LeftSortByCol5=6205
cm_LeftSortByCol6=6206
cm_LeftSortByCol7=6207
cm_LeftSortByCol8=6208
cm_LeftSortByCol9=6209
cm_LeftSortByCol10=6210
cm_LeftSortByCol11=6211
cm_LeftSortByCol12=6212
cm_LeftSortByCol13=6213
cm_LeftSortByCol14=6214
cm_LeftSortByCol15=6215
cm_LeftSortByCol16=6216
cm_LeftSortByCol17=6217
cm_LeftSortByCol18=6218
cm_LeftSortByCol19=6219
cm_LeftSortByCol20=6220
cm_LeftSortByCol21=6221
cm_LeftSortByCol22=6222
cm_LeftSortByCol23=6223
cm_LeftSortByCol24=6224
cm_LeftSortByCol25=6225
cm_LeftSortByCol26=6226
cm_LeftSortByCol27=6227
cm_LeftSortByCol28=6228
cm_LeftSortByCol29=6229
cm_LeftSortByCol30=6230
cm_LeftSortByCol31=6231
cm_LeftSortByCol32=6232
cm_LeftSortByCol33=6233
cm_LeftSortByCol34=6234
cm_LeftSortByCol35=6235
cm_LeftSortByCol36=6236
cm_LeftSortByCol37=6237
cm_LeftSortByCol38=6238
cm_LeftSortByCol39=6239
cm_LeftSortByCol40=6240
cm_LeftSortByCol41=6241
cm_LeftSortByCol42=6242
cm_LeftSortByCol43=6243
cm_LeftSortByCol44=6244
cm_LeftSortByCol45=6245
cm_LeftSortByCol46=6246
cm_LeftSortByCol47=6247
cm_LeftSortByCol48=6248
cm_LeftSortByCol49=6249
cm_LeftSortByCol50=6250
cm_LeftSortByCol51=6251
cm_LeftSortByCol52=6252
cm_LeftSortByCol53=6253
cm_LeftSortByCol54=6254
cm_LeftSortByCol55=6255
cm_LeftSortByCol56=6256
cm_LeftSortByCol57=6257
cm_LeftSortByCol58=6258
cm_LeftSortByCol59=6259
cm_LeftSortByCol60=6260
cm_LeftSortByCol61=6261
cm_LeftSortByCol62=6262
cm_LeftSortByCol63=6263
cm_LeftSortByCol64=6264
cm_LeftSortByCol65=6265
cm_LeftSortByCol66=6266
cm_LeftSortByCol67=6267
cm_LeftSortByCol68=6268
cm_LeftSortByCol69=6269
cm_LeftSortByCol70=6270
cm_LeftSortByCol71=6271
cm_LeftSortByCol72=6272
cm_LeftSortByCol73=6273
cm_LeftSortByCol74=6274
cm_LeftSortByCol75=6275
cm_LeftSortByCol76=6276
cm_LeftSortByCol77=6277
cm_LeftSortByCol78=6278
cm_LeftSortByCol79=6279
cm_LeftSortByCol80=6280
cm_LeftSortByCol81=6281
cm_LeftSortByCol82=6282
cm_LeftSortByCol83=6283
cm_LeftSortByCol84=6284
cm_LeftSortByCol85=6285
cm_LeftSortByCol86=6286
cm_LeftSortByCol87=6287
cm_LeftSortByCol88=6288
cm_LeftSortByCol89=6289
cm_LeftSortByCol90=6290
cm_LeftSortByCol91=6291
cm_LeftSortByCol92=6292
cm_LeftSortByCol93=6293
cm_LeftSortByCol94=6294
cm_LeftSortByCol95=6295
cm_LeftSortByCol96=6296
cm_LeftSortByCol97=6297
cm_LeftSortByCol98=6298
cm_LeftSortByCol99=6299
; 6301=Сортировать по 1-й колонке (правая панель); 6399 - Сортировать по 99-й колонке
cm_RightSortByCol1=6301
cm_RightSortByCol2=6302
cm_RightSortByCol3=6303
cm_RightSortByCol4=6304
cm_RightSortByCol5=6305
cm_RightSortByCol6=6306
cm_RightSortByCol7=6307
cm_RightSortByCol8=6308
cm_RightSortByCol9=6309
cm_RightSortByCol10=6310
cm_RightSortByCol11=6311
cm_RightSortByCol12=6312
cm_RightSortByCol13=6313
cm_RightSortByCol14=6314
cm_RightSortByCol15=6315
cm_RightSortByCol16=6316
cm_RightSortByCol17=6317
cm_RightSortByCol18=6318
cm_RightSortByCol19=6319
cm_RightSortByCol20=6320
cm_RightSortByCol21=6321
cm_RightSortByCol22=6322
cm_RightSortByCol23=6323
cm_RightSortByCol24=6324
cm_RightSortByCol25=6325
cm_RightSortByCol26=6326
cm_RightSortByCol27=6327
cm_RightSortByCol28=6328
cm_RightSortByCol29=6329
cm_RightSortByCol30=6330
cm_RightSortByCol31=6331
cm_RightSortByCol32=6332
cm_RightSortByCol33=6333
cm_RightSortByCol34=6334
cm_RightSortByCol35=6335
cm_RightSortByCol36=6336
cm_RightSortByCol37=6337
cm_RightSortByCol38=6338
cm_RightSortByCol39=6339
cm_RightSortByCol40=6340
cm_RightSortByCol41=6341
cm_RightSortByCol42=6342
cm_RightSortByCol43=6343
cm_RightSortByCol44=6344
cm_RightSortByCol45=6345
cm_RightSortByCol46=6346
cm_RightSortByCol47=6347
cm_RightSortByCol48=6348
cm_RightSortByCol49=6349
cm_RightSortByCol50=6350
cm_RightSortByCol51=6351
cm_RightSortByCol52=6352
cm_RightSortByCol53=6353
cm_RightSortByCol54=6354
cm_RightSortByCol55=6355
cm_RightSortByCol56=6356
cm_RightSortByCol57=6357
cm_RightSortByCol58=6358
cm_RightSortByCol59=6359
cm_RightSortByCol60=6360
cm_RightSortByCol61=6361
cm_RightSortByCol62=6362
cm_RightSortByCol63=6363
cm_RightSortByCol64=6364
cm_RightSortByCol65=6365
cm_RightSortByCol66=6366
cm_RightSortByCol67=6367
cm_RightSortByCol68=6368
cm_RightSortByCol69=6369
cm_RightSortByCol70=6370
cm_RightSortByCol71=6371
cm_RightSortByCol72=6372
cm_RightSortByCol73=6373
cm_RightSortByCol74=6374
cm_RightSortByCol75=6375
cm_RightSortByCol76=6376
cm_RightSortByCol77=6377
cm_RightSortByCol78=6378
cm_RightSortByCol79=6379
cm_RightSortByCol80=6380
cm_RightSortByCol81=6381
cm_RightSortByCol82=6382
cm_RightSortByCol83=6383
cm_RightSortByCol84=6384
cm_RightSortByCol85=6385
cm_RightSortByCol86=6386
cm_RightSortByCol87=6387
cm_RightSortByCol88=6388
cm_RightSortByCol89=6389
cm_RightSortByCol90=6390
cm_RightSortByCol91=6391
cm_RightSortByCol92=6392
cm_RightSortByCol93=6393
cm_RightSortByCol94=6394
cm_RightSortByCol95=6395
cm_RightSortByCol96=6396
cm_RightSortByCol97=6397
cm_RightSortByCol98=6398
cm_RightSortByCol99=6399
; 271=Активная панель: пользовательский набор 1; 299=Активная панель: пользовательский набор 29
cm_SrcCustomView1=271
cm_SrcCustomView2=272
cm_SrcCustomView3=273
cm_SrcCustomView4=274
cm_SrcCustomView5=275
cm_SrcCustomView6=276
cm_SrcCustomView7=277
cm_SrcCustomView8=278
cm_SrcCustomView9=279
cm_SrcCustomView10=280
cm_SrcCustomView11=281
cm_SrcCustomView12=282
cm_SrcCustomView13=283
cm_SrcCustomView14=284
cm_SrcCustomView15=285
cm_SrcCustomView16=286
cm_SrcCustomView17=287
cm_SrcCustomView18=288
cm_SrcCustomView19=289
cm_SrcCustomView20=290
cm_SrcCustomView21=291
cm_SrcCustomView22=292
cm_SrcCustomView23=293
cm_SrcCustomView24=294
cm_SrcCustomView25=295
cm_SrcCustomView26=296
cm_SrcCustomView27=297
cm_SrcCustomView28=298
cm_SrcCustomView29=299
; 7530=Активная панель: пользовательский набор 30; 7599=Активная панель: пользовательский набор 99
cm_SrcCustomView30=7530
cm_SrcCustomView31=7531
cm_SrcCustomView32=7532
cm_SrcCustomView33=7533
cm_SrcCustomView34=7534
cm_SrcCustomView35=7535
cm_SrcCustomView36=7536
cm_SrcCustomView37=7537
cm_SrcCustomView38=7538
cm_SrcCustomView39=7539
cm_SrcCustomView40=7540
cm_SrcCustomView41=7541
cm_SrcCustomView42=7542
cm_SrcCustomView43=7543
cm_SrcCustomView44=7544
cm_SrcCustomView45=7545
cm_SrcCustomView46=7546
cm_SrcCustomView47=7547
cm_SrcCustomView48=7548
cm_SrcCustomView49=7549
cm_SrcCustomView50=7550
cm_SrcCustomView51=7551
cm_SrcCustomView52=7552
cm_SrcCustomView53=7553
cm_SrcCustomView54=7554
cm_SrcCustomView55=7555
cm_SrcCustomView56=7556
cm_SrcCustomView57=7557
cm_SrcCustomView58=7558
cm_SrcCustomView59=7559
cm_SrcCustomView60=7560
cm_SrcCustomView61=7561
cm_SrcCustomView62=7562
cm_SrcCustomView63=7563
cm_SrcCustomView64=7564
cm_SrcCustomView65=7565
cm_SrcCustomView66=7566
cm_SrcCustomView67=7567
cm_SrcCustomView68=7568
cm_SrcCustomView69=7569
cm_SrcCustomView70=7570
cm_SrcCustomView71=7571
cm_SrcCustomView72=7572
cm_SrcCustomView73=7573
cm_SrcCustomView74=7574
cm_SrcCustomView75=7575
cm_SrcCustomView76=7576
cm_SrcCustomView77=7577
cm_SrcCustomView78=7578
cm_SrcCustomView79=7579
cm_SrcCustomView80=7580
cm_SrcCustomView81=7581
cm_SrcCustomView82=7582
cm_SrcCustomView83=7583
cm_SrcCustomView84=7584
cm_SrcCustomView85=7585
cm_SrcCustomView86=7586
cm_SrcCustomView87=7587
cm_SrcCustomView88=7588
cm_SrcCustomView89=7589
cm_SrcCustomView90=7590
cm_SrcCustomView91=7591
cm_SrcCustomView92=7592
cm_SrcCustomView93=7593
cm_SrcCustomView94=7594
cm_SrcCustomView95=7595
cm_SrcCustomView96=7596
cm_SrcCustomView97=7597
cm_SrcCustomView98=7598
cm_SrcCustomView99=7599
; 421=Неактивная панель: пользовательский набор 1; 449=Неактивная панель: пользовательский набор 29
cm_TrgCustomView1=421
cm_TrgCustomView2=422
cm_TrgCustomView3=423
cm_TrgCustomView4=424
cm_TrgCustomView5=425
cm_TrgCustomView6=426
cm_TrgCustomView7=427
cm_TrgCustomView8=428
cm_TrgCustomView9=429
cm_TrgCustomView10=430
cm_TrgCustomView11=431
cm_TrgCustomView12=432
cm_TrgCustomView13=433
cm_TrgCustomView14=434
cm_TrgCustomView15=435
cm_TrgCustomView16=436
cm_TrgCustomView17=437
cm_TrgCustomView18=438
cm_TrgCustomView19=439
cm_TrgCustomView20=440
cm_TrgCustomView21=441
cm_TrgCustomView22=442
cm_TrgCustomView23=443
cm_TrgCustomView24=444
cm_TrgCustomView25=445
cm_TrgCustomView26=446
cm_TrgCustomView27=447
cm_TrgCustomView28=448
cm_TrgCustomView29=449
; 71=Левая панель: пользовательский набор 1; 99=Левая панель: пользовательский набор 29
cm_LeftCustomView1=71
cm_LeftCustomView2=72
cm_LeftCustomView3=73
cm_LeftCustomView4=74
cm_LeftCustomView5=75
cm_LeftCustomView6=76
cm_LeftCustomView7=77
cm_LeftCustomView8=78
cm_LeftCustomView9=79
cm_LeftCustomView10=80
cm_LeftCustomView11=81
cm_LeftCustomView12=82
cm_LeftCustomView13=83
cm_LeftCustomView14=84
cm_LeftCustomView15=85
cm_LeftCustomView16=86
cm_LeftCustomView17=87
cm_LeftCustomView18=88
cm_LeftCustomView19=89
cm_LeftCustomView20=90
cm_LeftCustomView21=91
cm_LeftCustomView22=92
cm_LeftCustomView23=93
cm_LeftCustomView24=94
cm_LeftCustomView25=95
cm_LeftCustomView26=96
cm_LeftCustomView27=97
cm_LeftCustomView28=98
cm_LeftCustomView29=99
; 6530=Левая панель: пользовательский набор 30; 6599=Левая панель: пользовательский набор 99
cm_LeftCustomView30=6530
cm_LeftCustomView31=6531
cm_LeftCustomView32=6532
cm_LeftCustomView33=6533
cm_LeftCustomView34=6534
cm_LeftCustomView35=6535
cm_LeftCustomView36=6536
cm_LeftCustomView37=6537
cm_LeftCustomView38=6538
cm_LeftCustomView39=6539
cm_LeftCustomView40=6540
cm_LeftCustomView41=6541
cm_LeftCustomView42=6542
cm_LeftCustomView43=6543
cm_LeftCustomView44=6544
cm_LeftCustomView45=6545
cm_LeftCustomView46=6546
cm_LeftCustomView47=6547
cm_LeftCustomView48=6548
cm_LeftCustomView49=6549
cm_LeftCustomView50=6550
cm_LeftCustomView51=6551
cm_LeftCustomView52=6552
cm_LeftCustomView53=6553
cm_LeftCustomView54=6554
cm_LeftCustomView55=6555
cm_LeftCustomView56=6556
cm_LeftCustomView57=6557
cm_LeftCustomView58=6558
cm_LeftCustomView59=6559
cm_LeftCustomView60=6560
cm_LeftCustomView61=6561
cm_LeftCustomView62=6562
cm_LeftCustomView63=6563
cm_LeftCustomView64=6564
cm_LeftCustomView65=6565
cm_LeftCustomView66=6566
cm_LeftCustomView67=6567
cm_LeftCustomView68=6568
cm_LeftCustomView69=6569
cm_LeftCustomView70=6570
cm_LeftCustomView71=6571
cm_LeftCustomView72=6572
cm_LeftCustomView73=6573
cm_LeftCustomView74=6574
cm_LeftCustomView75=6575
cm_LeftCustomView76=6576
cm_LeftCustomView77=6577
cm_LeftCustomView78=6578
cm_LeftCustomView79=6579
cm_LeftCustomView80=6580
cm_LeftCustomView81=6581
cm_LeftCustomView82=6582
cm_LeftCustomView83=6583
cm_LeftCustomView84=6584
cm_LeftCustomView85=6585
cm_LeftCustomView86=6586
cm_LeftCustomView87=6587
cm_LeftCustomView88=6588
cm_LeftCustomView89=6589
cm_LeftCustomView90=6590
cm_LeftCustomView91=6591
cm_LeftCustomView92=6592
cm_LeftCustomView93=6593
cm_LeftCustomView94=6594
cm_LeftCustomView95=6595
cm_LeftCustomView96=6596
cm_LeftCustomView97=6597
cm_LeftCustomView98=6598
cm_LeftCustomView99=6599
; 171=Правая панель: пользовательский набор 1; 199=Правая панель: пользовательский набор 29
cm_RightCustomView1=171
cm_RightCustomView2=172
cm_RightCustomView3=173
cm_RightCustomView4=174
cm_RightCustomView5=175
cm_RightCustomView6=176
cm_RightCustomView7=177
cm_RightCustomView8=178
cm_RightCustomView9=179
cm_RightCustomView10=180
cm_RightCustomView11=181
cm_RightCustomView12=182
cm_RightCustomView13=183
cm_RightCustomView14=184
cm_RightCustomView15=185
cm_RightCustomView16=186
cm_RightCustomView17=187
cm_RightCustomView18=188
cm_RightCustomView19=189
cm_RightCustomView20=190
cm_RightCustomView21=191
cm_RightCustomView22=192
cm_RightCustomView23=193
cm_RightCustomView24=194
cm_RightCustomView25=195
cm_RightCustomView26=196
cm_RightCustomView27=197
cm_RightCustomView28=198
cm_RightCustomView29=199
; 7530=Правая панель: пользовательский набор 30; 7099=Правая панель: пользовательский набор 99
cm_RightCustomView30=7030
cm_RightCustomView31=7031
cm_RightCustomView32=7032
cm_RightCustomView33=7033
cm_RightCustomView34=7034
cm_RightCustomView35=7035
cm_RightCustomView36=7036
cm_RightCustomView37=7037
cm_RightCustomView38=7038
cm_RightCustomView39=7039
cm_RightCustomView40=7040
cm_RightCustomView41=7041
cm_RightCustomView42=7042
cm_RightCustomView43=7043
cm_RightCustomView44=7044
cm_RightCustomView45=7045
cm_RightCustomView46=7046
cm_RightCustomView47=7047
cm_RightCustomView48=7048
cm_RightCustomView49=7049
cm_RightCustomView50=7050
cm_RightCustomView51=7051
cm_RightCustomView52=7052
cm_RightCustomView53=7053
cm_RightCustomView54=7054
cm_RightCustomView55=7055
cm_RightCustomView56=7056
cm_RightCustomView57=7057
cm_RightCustomView58=7058
cm_RightCustomView59=7059
cm_RightCustomView60=7060
cm_RightCustomView61=7061
cm_RightCustomView62=7062
cm_RightCustomView63=7063
cm_RightCustomView64=7064
cm_RightCustomView65=7065
cm_RightCustomView66=7066
cm_RightCustomView67=7067
cm_RightCustomView68=7068
cm_RightCustomView69=7069
cm_RightCustomView70=7070
cm_RightCustomView71=7071
cm_RightCustomView72=7072
cm_RightCustomView73=7073
cm_RightCustomView74=7074
cm_RightCustomView75=7075
cm_RightCustomView76=7076
cm_RightCustomView77=7077
cm_RightCustomView78=7078
cm_RightCustomView79=7079
cm_RightCustomView80=7080
cm_RightCustomView81=7081
cm_RightCustomView82=7082
cm_RightCustomView83=7083
cm_RightCustomView84=7084
cm_RightCustomView85=7085
cm_RightCustomView86=7086
cm_RightCustomView87=7087
cm_RightCustomView88=7088
cm_RightCustomView89=7089
cm_RightCustomView90=7090
cm_RightCustomView91=7091
cm_RightCustomView92=7092
cm_RightCustomView93=7093
cm_RightCustomView94=7094
cm_RightCustomView95=7095
cm_RightCustomView96=7096
cm_RightCustomView97=7097
cm_RightCustomView98=7098
cm_RightCustomView99=7099

; 2947=Автовыбор стиля оформления: вкл/выкл
cm_ToggleAutoViewModeSwitch=2947
; 8500=Активная панель: стиль оформления по умолчанию (без цвета и значков)
cm_SrcViewMode0=8500
; 8501=Активная панель: стиль оформления 1; 8749=Активная панель: стиль оформления 249
cm_SrcViewMode1=8501
cm_SrcViewMode2=8502
cm_SrcViewMode3=8503
cm_SrcViewMode4=8504
cm_SrcViewMode5=8505
cm_SrcViewMode6=8506
cm_SrcViewMode7=8507
cm_SrcViewMode8=8508
cm_SrcViewMode9=8509
cm_SrcViewMode10=8510
cm_SrcViewMode11=8511
cm_SrcViewMode12=8512
cm_SrcViewMode13=8513
cm_SrcViewMode14=8514
cm_SrcViewMode15=8515
cm_SrcViewMode16=8516
cm_SrcViewMode17=8517
cm_SrcViewMode18=8518
cm_SrcViewMode19=8519
cm_SrcViewMode20=8520
cm_SrcViewMode21=8521
cm_SrcViewMode22=8522
cm_SrcViewMode23=8523
cm_SrcViewMode24=8524
cm_SrcViewMode25=8525
cm_SrcViewMode26=8526
cm_SrcViewMode27=8527
cm_SrcViewMode28=8528
cm_SrcViewMode29=8529
cm_SrcViewMode30=8530
cm_SrcViewMode31=8531
cm_SrcViewMode32=8532
cm_SrcViewMode33=8533
cm_SrcViewMode34=8534
cm_SrcViewMode35=8535
cm_SrcViewMode36=8536
cm_SrcViewMode37=8537
cm_SrcViewMode38=8538
cm_SrcViewMode39=8539
cm_SrcViewMode40=8540
cm_SrcViewMode41=8541
cm_SrcViewMode42=8542
cm_SrcViewMode43=8543
cm_SrcViewMode44=8544
cm_SrcViewMode45=8545
cm_SrcViewMode46=8546
cm_SrcViewMode47=8547
cm_SrcViewMode48=8548
cm_SrcViewMode49=8549
cm_SrcViewMode50=8550
cm_SrcViewMode51=8551
cm_SrcViewMode52=8552
cm_SrcViewMode53=8553
cm_SrcViewMode54=8554
cm_SrcViewMode55=8555
cm_SrcViewMode56=8556
cm_SrcViewMode57=8557
cm_SrcViewMode58=8558
cm_SrcViewMode59=8559
cm_SrcViewMode60=8560
cm_SrcViewMode61=8561
cm_SrcViewMode62=8562
cm_SrcViewMode63=8563
cm_SrcViewMode64=8564
cm_SrcViewMode65=8565
cm_SrcViewMode66=8566
cm_SrcViewMode67=8567
cm_SrcViewMode68=8568
cm_SrcViewMode69=8569
cm_SrcViewMode70=8570
cm_SrcViewMode71=8571
cm_SrcViewMode72=8572
cm_SrcViewMode73=8573
cm_SrcViewMode74=8574
cm_SrcViewMode75=8575
cm_SrcViewMode76=8576
cm_SrcViewMode77=8577
cm_SrcViewMode78=8578
cm_SrcViewMode79=8579
cm_SrcViewMode80=8580
cm_SrcViewMode81=8581
cm_SrcViewMode82=8582
cm_SrcViewMode83=8583
cm_SrcViewMode84=8584
cm_SrcViewMode85=8585
cm_SrcViewMode86=8586
cm_SrcViewMode87=8587
cm_SrcViewMode88=8588
cm_SrcViewMode89=8589
cm_SrcViewMode90=8590
cm_SrcViewMode91=8591
cm_SrcViewMode92=8592
cm_SrcViewMode93=8593
cm_SrcViewMode94=8594
cm_SrcViewMode95=8595
cm_SrcViewMode96=8596
cm_SrcViewMode97=8597
cm_SrcViewMode98=8598
cm_SrcViewMode99=8599
cm_SrcViewMode100=8600
cm_SrcViewMode101=8601
cm_SrcViewMode102=8602
cm_SrcViewMode103=8603
cm_SrcViewMode104=8604
cm_SrcViewMode105=8605
cm_SrcViewMode106=8606
cm_SrcViewMode107=8607
cm_SrcViewMode108=8608
cm_SrcViewMode109=8609
cm_SrcViewMode110=8610
cm_SrcViewMode111=8611
cm_SrcViewMode112=8612
cm_SrcViewMode113=8613
cm_SrcViewMode114=8614
cm_SrcViewMode115=8615
cm_SrcViewMode116=8616
cm_SrcViewMode117=8617
cm_SrcViewMode118=8618
cm_SrcViewMode119=8619
cm_SrcViewMode120=8620
cm_SrcViewMode121=8621
cm_SrcViewMode122=8622
cm_SrcViewMode123=8623
cm_SrcViewMode124=8624
cm_SrcViewMode125=8625
cm_SrcViewMode126=8626
cm_SrcViewMode127=8627
cm_SrcViewMode128=8628
cm_SrcViewMode129=8629
cm_SrcViewMode130=8630
cm_SrcViewMode131=8631
cm_SrcViewMode132=8632
cm_SrcViewMode133=8633
cm_SrcViewMode134=8634
cm_SrcViewMode135=8635
cm_SrcViewMode136=8636
cm_SrcViewMode137=8637
cm_SrcViewMode138=8638
cm_SrcViewMode139=8639
cm_SrcViewMode140=8640
cm_SrcViewMode141=8641
cm_SrcViewMode142=8642
cm_SrcViewMode143=8643
cm_SrcViewMode144=8644
cm_SrcViewMode145=8645
cm_SrcViewMode146=8646
cm_SrcViewMode147=8647
cm_SrcViewMode148=8648
cm_SrcViewMode149=8649
cm_SrcViewMode150=8650
cm_SrcViewMode151=8651
cm_SrcViewMode152=8652
cm_SrcViewMode153=8653
cm_SrcViewMode154=8654
cm_SrcViewMode155=8655
cm_SrcViewMode156=8656
cm_SrcViewMode157=8657
cm_SrcViewMode158=8658
cm_SrcViewMode159=8659
cm_SrcViewMode160=8660
cm_SrcViewMode161=8661
cm_SrcViewMode162=8662
cm_SrcViewMode163=8663
cm_SrcViewMode164=8664
cm_SrcViewMode165=8665
cm_SrcViewMode166=8666
cm_SrcViewMode167=8667
cm_SrcViewMode168=8668
cm_SrcViewMode169=8669
cm_SrcViewMode170=8670
cm_SrcViewMode171=8671
cm_SrcViewMode172=8672
cm_SrcViewMode173=8673
cm_SrcViewMode174=8674
cm_SrcViewMode175=8675
cm_SrcViewMode176=8676
cm_SrcViewMode177=8677
cm_SrcViewMode178=8678
cm_SrcViewMode179=8679
cm_SrcViewMode180=8680
cm_SrcViewMode181=8681
cm_SrcViewMode182=8682
cm_SrcViewMode183=8683
cm_SrcViewMode184=8684
cm_SrcViewMode185=8685
cm_SrcViewMode186=8686
cm_SrcViewMode187=8687
cm_SrcViewMode188=8688
cm_SrcViewMode189=8689
cm_SrcViewMode190=8690
cm_SrcViewMode191=8691
cm_SrcViewMode192=8692
cm_SrcViewMode193=8693
cm_SrcViewMode194=8694
cm_SrcViewMode195=8695
cm_SrcViewMode196=8696
cm_SrcViewMode197=8697
cm_SrcViewMode198=8698
cm_SrcViewMode199=8699
cm_SrcViewMode200=8700
cm_SrcViewMode201=8701
cm_SrcViewMode202=8702
cm_SrcViewMode203=8703
cm_SrcViewMode204=8704
cm_SrcViewMode205=8705
cm_SrcViewMode206=8706
cm_SrcViewMode207=8707
cm_SrcViewMode208=8708
cm_SrcViewMode209=8709
cm_SrcViewMode210=8710
cm_SrcViewMode211=8711
cm_SrcViewMode212=8712
cm_SrcViewMode213=8713
cm_SrcViewMode214=8714
cm_SrcViewMode215=8715
cm_SrcViewMode216=8716
cm_SrcViewMode217=8717
cm_SrcViewMode218=8718
cm_SrcViewMode219=8719
cm_SrcViewMode220=8720
cm_SrcViewMode221=8721
cm_SrcViewMode222=8722
cm_SrcViewMode223=8723
cm_SrcViewMode224=8724
cm_SrcViewMode225=8725
cm_SrcViewMode226=8726
cm_SrcViewMode227=8727
cm_SrcViewMode228=8728
cm_SrcViewMode229=8729
cm_SrcViewMode230=8730
cm_SrcViewMode231=8731
cm_SrcViewMode232=8732
cm_SrcViewMode233=8733
cm_SrcViewMode234=8734
cm_SrcViewMode235=8735
cm_SrcViewMode236=8736
cm_SrcViewMode237=8737
cm_SrcViewMode238=8738
cm_SrcViewMode239=8739
cm_SrcViewMode240=8740
cm_SrcViewMode241=8741
cm_SrcViewMode242=8742
cm_SrcViewMode243=8743
cm_SrcViewMode244=8744
cm_SrcViewMode245=8745
cm_SrcViewMode246=8746
cm_SrcViewMode247=8747
cm_SrcViewMode248=8748
cm_SrcViewMode249=8749
; 8750=Неактивная: стиль оформления по умолчанию (без цвета и значков)
cm_TrgViewMode0=8750
; 8751=Неактивная панель: стиль оформления 1; 8999=Неактивная панель: стиль оформления 249
cm_TrgViewMode1=8751
cm_TrgViewMode2=8752
cm_TrgViewMode3=8753
cm_TrgViewMode4=8754
cm_TrgViewMode5=8755
cm_TrgViewMode6=8756
cm_TrgViewMode7=8757
cm_TrgViewMode8=8758
cm_TrgViewMode9=8759
cm_TrgViewMode10=8760
cm_TrgViewMode11=8761
cm_TrgViewMode12=8762
cm_TrgViewMode13=8763
cm_TrgViewMode14=8764
cm_TrgViewMode15=8765
cm_TrgViewMode16=8766
cm_TrgViewMode17=8767
cm_TrgViewMode18=8768
cm_TrgViewMode19=8769
cm_TrgViewMode20=8770
cm_TrgViewMode21=8771
cm_TrgViewMode22=8772
cm_TrgViewMode23=8773
cm_TrgViewMode24=8774
cm_TrgViewMode25=8775
cm_TrgViewMode26=8776
cm_TrgViewMode27=8777
cm_TrgViewMode28=8778
cm_TrgViewMode29=8779
cm_TrgViewMode30=8780
cm_TrgViewMode31=8781
cm_TrgViewMode32=8782
cm_TrgViewMode33=8783
cm_TrgViewMode34=8784
cm_TrgViewMode35=8785
cm_TrgViewMode36=8786
cm_TrgViewMode37=8787
cm_TrgViewMode38=8788
cm_TrgViewMode39=8789
cm_TrgViewMode40=8790
cm_TrgViewMode41=8791
cm_TrgViewMode42=8792
cm_TrgViewMode43=8793
cm_TrgViewMode44=8794
cm_TrgViewMode45=8795
cm_TrgViewMode46=8796
cm_TrgViewMode47=8797
cm_TrgViewMode48=8798
cm_TrgViewMode49=8799
cm_TrgViewMode50=8800
cm_TrgViewMode51=8801
cm_TrgViewMode52=8802
cm_TrgViewMode53=8803
cm_TrgViewMode54=8804
cm_TrgViewMode55=8805
cm_TrgViewMode56=8806
cm_TrgViewMode57=8807
cm_TrgViewMode58=8808
cm_TrgViewMode59=8809
cm_TrgViewMode60=8810
cm_TrgViewMode61=8811
cm_TrgViewMode62=8812
cm_TrgViewMode63=8813
cm_TrgViewMode64=8814
cm_TrgViewMode65=8815
cm_TrgViewMode66=8816
cm_TrgViewMode67=8817
cm_TrgViewMode68=8818
cm_TrgViewMode69=8819
cm_TrgViewMode70=8820
cm_TrgViewMode71=8821
cm_TrgViewMode72=8822
cm_TrgViewMode73=8823
cm_TrgViewMode74=8824
cm_TrgViewMode75=8825
cm_TrgViewMode76=8826
cm_TrgViewMode77=8827
cm_TrgViewMode78=8828
cm_TrgViewMode79=8829
cm_TrgViewMode80=8830
cm_TrgViewMode81=8831
cm_TrgViewMode82=8832
cm_TrgViewMode83=8833
cm_TrgViewMode84=8834
cm_TrgViewMode85=8835
cm_TrgViewMode86=8836
cm_TrgViewMode87=8837
cm_TrgViewMode88=8838
cm_TrgViewMode89=8839
cm_TrgViewMode90=8840
cm_TrgViewMode91=8841
cm_TrgViewMode92=8842
cm_TrgViewMode93=8843
cm_TrgViewMode94=8844
cm_TrgViewMode95=8845
cm_TrgViewMode96=8846
cm_TrgViewMode97=8847
cm_TrgViewMode98=8848
cm_TrgViewMode99=8849
cm_TrgViewMode100=8850
cm_TrgViewMode101=8851
cm_TrgViewMode102=8852
cm_TrgViewMode103=8853
cm_TrgViewMode104=8854
cm_TrgViewMode105=8855
cm_TrgViewMode106=8856
cm_TrgViewMode107=8857
cm_TrgViewMode108=8858
cm_TrgViewMode109=8859
cm_TrgViewMode110=8860
cm_TrgViewMode111=8861
cm_TrgViewMode112=8862
cm_TrgViewMode113=8863
cm_TrgViewMode114=8864
cm_TrgViewMode115=8865
cm_TrgViewMode116=8866
cm_TrgViewMode117=8867
cm_TrgViewMode118=8868
cm_TrgViewMode119=8869
cm_TrgViewMode120=8870
cm_TrgViewMode121=8871
cm_TrgViewMode122=8872
cm_TrgViewMode123=8873
cm_TrgViewMode124=8874
cm_TrgViewMode125=8875
cm_TrgViewMode126=8876
cm_TrgViewMode127=8877
cm_TrgViewMode128=8878
cm_TrgViewMode129=8879
cm_TrgViewMode130=8880
cm_TrgViewMode131=8881
cm_TrgViewMode132=8882
cm_TrgViewMode133=8883
cm_TrgViewMode134=8884
cm_TrgViewMode135=8885
cm_TrgViewMode136=8886
cm_TrgViewMode137=8887
cm_TrgViewMode138=8888
cm_TrgViewMode139=8889
cm_TrgViewMode140=8890
cm_TrgViewMode141=8891
cm_TrgViewMode142=8892
cm_TrgViewMode143=8893
cm_TrgViewMode144=8894
cm_TrgViewMode145=8895
cm_TrgViewMode146=8896
cm_TrgViewMode147=8897
cm_TrgViewMode148=8898
cm_TrgViewMode149=8899
cm_TrgViewMode150=8900
cm_TrgViewMode151=8901
cm_TrgViewMode152=8902
cm_TrgViewMode153=8903
cm_TrgViewMode154=8904
cm_TrgViewMode155=8905
cm_TrgViewMode156=8906
cm_TrgViewMode157=8907
cm_TrgViewMode158=8908
cm_TrgViewMode159=8909
cm_TrgViewMode160=8910
cm_TrgViewMode161=8911
cm_TrgViewMode162=8912
cm_TrgViewMode163=8913
cm_TrgViewMode164=8914
cm_TrgViewMode165=8915
cm_TrgViewMode166=8916
cm_TrgViewMode167=8917
cm_TrgViewMode168=8918
cm_TrgViewMode169=8919
cm_TrgViewMode170=8920
cm_TrgViewMode171=8921
cm_TrgViewMode172=8922
cm_TrgViewMode173=8923
cm_TrgViewMode174=8924
cm_TrgViewMode175=8925
cm_TrgViewMode176=8926
cm_TrgViewMode177=8927
cm_TrgViewMode178=8928
cm_TrgViewMode179=8929
cm_TrgViewMode180=8930
cm_TrgViewMode181=8931
cm_TrgViewMode182=8932
cm_TrgViewMode183=8933
cm_TrgViewMode184=8934
cm_TrgViewMode185=8935
cm_TrgViewMode186=8936
cm_TrgViewMode187=8937
cm_TrgViewMode188=8938
cm_TrgViewMode189=8939
cm_TrgViewMode190=8940
cm_TrgViewMode191=8941
cm_TrgViewMode192=8942
cm_TrgViewMode193=8943
cm_TrgViewMode194=8944
cm_TrgViewMode195=8945
cm_TrgViewMode196=8946
cm_TrgViewMode197=8947
cm_TrgViewMode198=8948
cm_TrgViewMode199=8949
cm_TrgViewMode200=8950
cm_TrgViewMode201=8951
cm_TrgViewMode202=8952
cm_TrgViewMode203=8953
cm_TrgViewMode204=8954
cm_TrgViewMode205=8955
cm_TrgViewMode206=8956
cm_TrgViewMode207=8957
cm_TrgViewMode208=8958
cm_TrgViewMode209=8959
cm_TrgViewMode210=8960
cm_TrgViewMode211=8961
cm_TrgViewMode212=8962
cm_TrgViewMode213=8963
cm_TrgViewMode214=8964
cm_TrgViewMode215=8965
cm_TrgViewMode216=8966
cm_TrgViewMode217=8967
cm_TrgViewMode218=8968
cm_TrgViewMode219=8969
cm_TrgViewMode220=8970
cm_TrgViewMode221=8971
cm_TrgViewMode222=8972
cm_TrgViewMode223=8973
cm_TrgViewMode224=8974
cm_TrgViewMode225=8975
cm_TrgViewMode226=8976
cm_TrgViewMode227=8977
cm_TrgViewMode228=8978
cm_TrgViewMode229=8979
cm_TrgViewMode230=8980
cm_TrgViewMode231=8981
cm_TrgViewMode232=8982
cm_TrgViewMode233=8983
cm_TrgViewMode234=8984
cm_TrgViewMode235=8985
cm_TrgViewMode236=8986
cm_TrgViewMode237=8987
cm_TrgViewMode238=8988
cm_TrgViewMode239=8989
cm_TrgViewMode240=8990
cm_TrgViewMode241=8991
cm_TrgViewMode242=8992
cm_TrgViewMode243=8993
cm_TrgViewMode244=8994
cm_TrgViewMode245=8995
cm_TrgViewMode246=8996
cm_TrgViewMode247=8997
cm_TrgViewMode248=8998
cm_TrgViewMode249=8999
; 8000=Слева: стиль оформления по умолчанию (без цвета и значков)
cm_LeftViewMode0=8000
; 8001=Левая панель: стиль оформления 1; 8249=Левая панель: стиль оформления 249
cm_LeftViewMode1=8001
cm_LeftViewMode2=8002
cm_LeftViewMode3=8003
cm_LeftViewMode4=8004
cm_LeftViewMode5=8005
cm_LeftViewMode6=8006
cm_LeftViewMode7=8007
cm_LeftViewMode8=8008
cm_LeftViewMode9=8009
cm_LeftViewMode10=8010
cm_LeftViewMode11=8011
cm_LeftViewMode12=8012
cm_LeftViewMode13=8013
cm_LeftViewMode14=8014
cm_LeftViewMode15=8015
cm_LeftViewMode16=8016
cm_LeftViewMode17=8017
cm_LeftViewMode18=8018
cm_LeftViewMode19=8019
cm_LeftViewMode20=8020
cm_LeftViewMode21=8021
cm_LeftViewMode22=8022
cm_LeftViewMode23=8023
cm_LeftViewMode24=8024
cm_LeftViewMode25=8025
cm_LeftViewMode26=8026
cm_LeftViewMode27=8027
cm_LeftViewMode28=8028
cm_LeftViewMode29=8029
cm_LeftViewMode30=8030
cm_LeftViewMode31=8031
cm_LeftViewMode32=8032
cm_LeftViewMode33=8033
cm_LeftViewMode34=8034
cm_LeftViewMode35=8035
cm_LeftViewMode36=8036
cm_LeftViewMode37=8037
cm_LeftViewMode38=8038
cm_LeftViewMode39=8039
cm_LeftViewMode40=8040
cm_LeftViewMode41=8041
cm_LeftViewMode42=8042
cm_LeftViewMode43=8043
cm_LeftViewMode44=8044
cm_LeftViewMode45=8045
cm_LeftViewMode46=8046
cm_LeftViewMode47=8047
cm_LeftViewMode48=8048
cm_LeftViewMode49=8049
cm_LeftViewMode50=8050
cm_LeftViewMode51=8051
cm_LeftViewMode52=8052
cm_LeftViewMode53=8053
cm_LeftViewMode54=8054
cm_LeftViewMode55=8055
cm_LeftViewMode56=8056
cm_LeftViewMode57=8057
cm_LeftViewMode58=8058
cm_LeftViewMode59=8059
cm_LeftViewMode60=8060
cm_LeftViewMode61=8061
cm_LeftViewMode62=8062
cm_LeftViewMode63=8063
cm_LeftViewMode64=8064
cm_LeftViewMode65=8065
cm_LeftViewMode66=8066
cm_LeftViewMode67=8067
cm_LeftViewMode68=8068
cm_LeftViewMode69=8069
cm_LeftViewMode70=8070
cm_LeftViewMode71=8071
cm_LeftViewMode72=8072
cm_LeftViewMode73=8073
cm_LeftViewMode74=8074
cm_LeftViewMode75=8075
cm_LeftViewMode76=8076
cm_LeftViewMode77=8077
cm_LeftViewMode78=8078
cm_LeftViewMode79=8079
cm_LeftViewMode80=8080
cm_LeftViewMode81=8081
cm_LeftViewMode82=8082
cm_LeftViewMode83=8083
cm_LeftViewMode84=8084
cm_LeftViewMode85=8085
cm_LeftViewMode86=8086
cm_LeftViewMode87=8087
cm_LeftViewMode88=8088
cm_LeftViewMode89=8089
cm_LeftViewMode90=8090
cm_LeftViewMode91=8091
cm_LeftViewMode92=8092
cm_LeftViewMode93=8093
cm_LeftViewMode94=8094
cm_LeftViewMode95=8095
cm_LeftViewMode96=8096
cm_LeftViewMode97=8097
cm_LeftViewMode98=8098
cm_LeftViewMode99=8099
cm_LeftViewMode100=8100
cm_LeftViewMode101=8101
cm_LeftViewMode102=8102
cm_LeftViewMode103=8103
cm_LeftViewMode104=8104
cm_LeftViewMode105=8105
cm_LeftViewMode106=8106
cm_LeftViewMode107=8107
cm_LeftViewMode108=8108
cm_LeftViewMode109=8109
cm_LeftViewMode110=8110
cm_LeftViewMode111=8111
cm_LeftViewMode112=8112
cm_LeftViewMode113=8113
cm_LeftViewMode114=8114
cm_LeftViewMode115=8115
cm_LeftViewMode116=8116
cm_LeftViewMode117=8117
cm_LeftViewMode118=8118
cm_LeftViewMode119=8119
cm_LeftViewMode120=8120
cm_LeftViewMode121=8121
cm_LeftViewMode122=8122
cm_LeftViewMode123=8123
cm_LeftViewMode124=8124
cm_LeftViewMode125=8125
cm_LeftViewMode126=8126
cm_LeftViewMode127=8127
cm_LeftViewMode128=8128
cm_LeftViewMode129=8129
cm_LeftViewMode130=8130
cm_LeftViewMode131=8131
cm_LeftViewMode132=8132
cm_LeftViewMode133=8133
cm_LeftViewMode134=8134
cm_LeftViewMode135=8135
cm_LeftViewMode136=8136
cm_LeftViewMode137=8137
cm_LeftViewMode138=8138
cm_LeftViewMode139=8139
cm_LeftViewMode140=8140
cm_LeftViewMode141=8141
cm_LeftViewMode142=8142
cm_LeftViewMode143=8143
cm_LeftViewMode144=8144
cm_LeftViewMode145=8145
cm_LeftViewMode146=8146
cm_LeftViewMode147=8147
cm_LeftViewMode148=8148
cm_LeftViewMode149=8149
cm_LeftViewMode150=8150
cm_LeftViewMode151=8151
cm_LeftViewMode152=8152
cm_LeftViewMode153=8153
cm_LeftViewMode154=8154
cm_LeftViewMode155=8155
cm_LeftViewMode156=8156
cm_LeftViewMode157=8157
cm_LeftViewMode158=8158
cm_LeftViewMode159=8159
cm_LeftViewMode160=8160
cm_LeftViewMode161=8161
cm_LeftViewMode162=8162
cm_LeftViewMode163=8163
cm_LeftViewMode164=8164
cm_LeftViewMode165=8165
cm_LeftViewMode166=8166
cm_LeftViewMode167=8167
cm_LeftViewMode168=8168
cm_LeftViewMode169=8169
cm_LeftViewMode170=8170
cm_LeftViewMode171=8171
cm_LeftViewMode172=8172
cm_LeftViewMode173=8173
cm_LeftViewMode174=8174
cm_LeftViewMode175=8175
cm_LeftViewMode176=8176
cm_LeftViewMode177=8177
cm_LeftViewMode178=8178
cm_LeftViewMode179=8179
cm_LeftViewMode180=8180
cm_LeftViewMode181=8181
cm_LeftViewMode182=8182
cm_LeftViewMode183=8183
cm_LeftViewMode184=8184
cm_LeftViewMode185=8185
cm_LeftViewMode186=8186
cm_LeftViewMode187=8187
cm_LeftViewMode188=8188
cm_LeftViewMode189=8189
cm_LeftViewMode190=8190
cm_LeftViewMode191=8191
cm_LeftViewMode192=8192
cm_LeftViewMode193=8193
cm_LeftViewMode194=8194
cm_LeftViewMode195=8195
cm_LeftViewMode196=8196
cm_LeftViewMode197=8197
cm_LeftViewMode198=8198
cm_LeftViewMode199=8199
cm_LeftViewMode200=8200
cm_LeftViewMode201=8201
cm_LeftViewMode202=8202
cm_LeftViewMode203=8203
cm_LeftViewMode204=8204
cm_LeftViewMode205=8205
cm_LeftViewMode206=8206
cm_LeftViewMode207=8207
cm_LeftViewMode208=8208
cm_LeftViewMode209=8209
cm_LeftViewMode210=8210
cm_LeftViewMode211=8211
cm_LeftViewMode212=8212
cm_LeftViewMode213=8213
cm_LeftViewMode214=8214
cm_LeftViewMode215=8215
cm_LeftViewMode216=8216
cm_LeftViewMode217=8217
cm_LeftViewMode218=8218
cm_LeftViewMode219=8219
cm_LeftViewMode220=8220
cm_LeftViewMode221=8221
cm_LeftViewMode222=8222
cm_LeftViewMode223=8223
cm_LeftViewMode224=8224
cm_LeftViewMode225=8225
cm_LeftViewMode226=8226
cm_LeftViewMode227=8227
cm_LeftViewMode228=8228
cm_LeftViewMode229=8229
cm_LeftViewMode230=8230
cm_LeftViewMode231=8231
cm_LeftViewMode232=8232
cm_LeftViewMode233=8233
cm_LeftViewMode234=8234
cm_LeftViewMode235=8235
cm_LeftViewMode236=8236
cm_LeftViewMode237=8237
cm_LeftViewMode238=8238
cm_LeftViewMode239=8239
cm_LeftViewMode240=8240
cm_LeftViewMode241=8241
cm_LeftViewMode242=8242
cm_LeftViewMode243=8243
cm_LeftViewMode244=8244
cm_LeftViewMode245=8245
cm_LeftViewMode246=8246
cm_LeftViewMode247=8247
cm_LeftViewMode248=8248
cm_LeftViewMode249=8249
; 8250=Правая панель: стиль оформления по умолчанию (без цвета и значков)
cm_RightViewMode0=8250
; 8251=Правая панель: стиль оформления 1; 8499=Правая панель: стиль оформления 249
cm_RightViewMode1=8251
cm_RightViewMode2=8252
cm_RightViewMode3=8253
cm_RightViewMode4=8254
cm_RightViewMode5=8255
cm_RightViewMode6=8256
cm_RightViewMode7=8257
cm_RightViewMode8=8258
cm_RightViewMode9=8259
cm_RightViewMode10=8260
cm_RightViewMode11=8261
cm_RightViewMode12=8262
cm_RightViewMode13=8263
cm_RightViewMode14=8264
cm_RightViewMode15=8265
cm_RightViewMode16=8266
cm_RightViewMode17=8267
cm_RightViewMode18=8268
cm_RightViewMode19=8269
cm_RightViewMode20=8270
cm_RightViewMode21=8271
cm_RightViewMode22=8272
cm_RightViewMode23=8273
cm_RightViewMode24=8274
cm_RightViewMode25=8275
cm_RightViewMode26=8276
cm_RightViewMode27=8277
cm_RightViewMode28=8278
cm_RightViewMode29=8279
cm_RightViewMode30=8280
cm_RightViewMode31=8281
cm_RightViewMode32=8282
cm_RightViewMode33=8283
cm_RightViewMode34=8284
cm_RightViewMode35=8285
cm_RightViewMode36=8286
cm_RightViewMode37=8287
cm_RightViewMode38=8288
cm_RightViewMode39=8289
cm_RightViewMode40=8290
cm_RightViewMode41=8291
cm_RightViewMode42=8292
cm_RightViewMode43=8293
cm_RightViewMode44=8294
cm_RightViewMode45=8295
cm_RightViewMode46=8296
cm_RightViewMode47=8297
cm_RightViewMode48=8298
cm_RightViewMode49=8299
cm_RightViewMode50=8300
cm_RightViewMode51=8301
cm_RightViewMode52=8302
cm_RightViewMode53=8303
cm_RightViewMode54=8304
cm_RightViewMode55=8305
cm_RightViewMode56=8306
cm_RightViewMode57=8307
cm_RightViewMode58=8308
cm_RightViewMode59=8309
cm_RightViewMode60=8310
cm_RightViewMode61=8311
cm_RightViewMode62=8312
cm_RightViewMode63=8313
cm_RightViewMode64=8314
cm_RightViewMode65=8315
cm_RightViewMode66=8316
cm_RightViewMode67=8317
cm_RightViewMode68=8318
cm_RightViewMode69=8319
cm_RightViewMode70=8320
cm_RightViewMode71=8321
cm_RightViewMode72=8322
cm_RightViewMode73=8323
cm_RightViewMode74=8324
cm_RightViewMode75=8325
cm_RightViewMode76=8326
cm_RightViewMode77=8327
cm_RightViewMode78=8328
cm_RightViewMode79=8329
cm_RightViewMode80=8330
cm_RightViewMode81=8331
cm_RightViewMode82=8332
cm_RightViewMode83=8333
cm_RightViewMode84=8334
cm_RightViewMode85=8335
cm_RightViewMode86=8336
cm_RightViewMode87=8337
cm_RightViewMode88=8338
cm_RightViewMode89=8339
cm_RightViewMode90=8340
cm_RightViewMode91=8341
cm_RightViewMode92=8342
cm_RightViewMode93=8343
cm_RightViewMode94=8344
cm_RightViewMode95=8345
cm_RightViewMode96=8346
cm_RightViewMode97=8347
cm_RightViewMode98=8348
cm_RightViewMode99=8349
cm_RightViewMode100=8350
cm_RightViewMode101=8351
cm_RightViewMode102=8352
cm_RightViewMode103=8353
cm_RightViewMode104=8354
cm_RightViewMode105=8355
cm_RightViewMode106=8356
cm_RightViewMode107=8357
cm_RightViewMode108=8358
cm_RightViewMode109=8359
cm_RightViewMode110=8360
cm_RightViewMode111=8361
cm_RightViewMode112=8362
cm_RightViewMode113=8363
cm_RightViewMode114=8364
cm_RightViewMode115=8365
cm_RightViewMode116=8366
cm_RightViewMode117=8367
cm_RightViewMode118=8368
cm_RightViewMode119=8369
cm_RightViewMode120=8370
cm_RightViewMode121=8371
cm_RightViewMode122=8372
cm_RightViewMode123=8373
cm_RightViewMode124=8374
cm_RightViewMode125=8375
cm_RightViewMode126=8376
cm_RightViewMode127=8377
cm_RightViewMode128=8378
cm_RightViewMode129=8379
cm_RightViewMode130=8380
cm_RightViewMode131=8381
cm_RightViewMode132=8382
cm_RightViewMode133=8383
cm_RightViewMode134=8384
cm_RightViewMode135=8385
cm_RightViewMode136=8386
cm_RightViewMode137=8387
cm_RightViewMode138=8388
cm_RightViewMode139=8389
cm_RightViewMode140=8390
cm_RightViewMode141=8391
cm_RightViewMode142=8392
cm_RightViewMode143=8393
cm_RightViewMode144=8394
cm_RightViewMode145=8395
cm_RightViewMode146=8396
cm_RightViewMode147=8397
cm_RightViewMode148=8398
cm_RightViewMode149=8399
cm_RightViewMode150=8400
cm_RightViewMode151=8401
cm_RightViewMode152=8402
cm_RightViewMode153=8403
cm_RightViewMode154=8404
cm_RightViewMode155=8405
cm_RightViewMode156=8406
cm_RightViewMode157=8407
cm_RightViewMode158=8408
cm_RightViewMode159=8409
cm_RightViewMode160=8410
cm_RightViewMode161=8411
cm_RightViewMode162=8412
cm_RightViewMode163=8413
cm_RightViewMode164=8414
cm_RightViewMode165=8415
cm_RightViewMode166=8416
cm_RightViewMode167=8417
cm_RightViewMode168=8418
cm_RightViewMode169=8419
cm_RightViewMode170=8420
cm_RightViewMode171=8421
cm_RightViewMode172=8422
cm_RightViewMode173=8423
cm_RightViewMode174=8424
cm_RightViewMode175=8425
cm_RightViewMode176=8426
cm_RightViewMode177=8427
cm_RightViewMode178=8428
cm_RightViewMode179=8429
cm_RightViewMode180=8430
cm_RightViewMode181=8431
cm_RightViewMode182=8432
cm_RightViewMode183=8433
cm_RightViewMode184=8434
cm_RightViewMode185=8435
cm_RightViewMode186=8436
cm_RightViewMode187=8437
cm_RightViewMode188=8438
cm_RightViewMode189=8439
cm_RightViewMode190=8440
cm_RightViewMode191=8441
cm_RightViewMode192=8442
cm_RightViewMode193=8443
cm_RightViewMode194=8444
cm_RightViewMode195=8445
cm_RightViewMode196=8446
cm_RightViewMode197=8447
cm_RightViewMode198=8448
cm_RightViewMode199=8449
cm_RightViewMode200=8450
cm_RightViewMode201=8451
cm_RightViewMode202=8452
cm_RightViewMode203=8453
cm_RightViewMode204=8454
cm_RightViewMode205=8455
cm_RightViewMode206=8456
cm_RightViewMode207=8457
cm_RightViewMode208=8458
cm_RightViewMode209=8459
cm_RightViewMode210=8460
cm_RightViewMode211=8461
cm_RightViewMode212=8462
cm_RightViewMode213=8463
cm_RightViewMode214=8464
cm_RightViewMode215=8465
cm_RightViewMode216=8466
cm_RightViewMode217=8467
cm_RightViewMode218=8468
cm_RightViewMode219=8469
cm_RightViewMode220=8470
cm_RightViewMode221=8471
cm_RightViewMode222=8472
cm_RightViewMode223=8473
cm_RightViewMode224=8474
cm_RightViewMode225=8475
cm_RightViewMode226=8476
cm_RightViewMode227=8477
cm_RightViewMode228=8478
cm_RightViewMode229=8479
cm_RightViewMode230=8480
cm_RightViewMode231=8481
cm_RightViewMode232=8482
cm_RightViewMode233=8483
cm_RightViewMode234=8484
cm_RightViewMode235=8485
cm_RightViewMode236=8486
cm_RightViewMode237=8487
cm_RightViewMode238=8488
cm_RightViewMode239=8489
cm_RightViewMode240=8490
cm_RightViewMode241=8491
cm_RightViewMode242=8492
cm_RightViewMode243=8493
cm_RightViewMode244=8494
cm_RightViewMode245=8495
cm_RightViewMode246=8496
cm_RightViewMode247=8497
cm_RightViewMode248=8498
cm_RightViewMode249=8499